import React, { useEffect, useState } from 'react'
import { Divider, Tabs } from 'antd'
import { Box, Flex } from 'noui/Position'
import { Header, Quote, Paragraph, SecretText, Msg } from 'ui/Text'
import { isMobile } from 'noui/MediaQuery'
import thayParty from './shared/party.jpeg'

const CultOfTheDragon = ({history, location}) => {
  const [tab, setTab] = useState(location.hash.substring(1) || 'main')
  
  useEffect(() => {
    history.replace({
      path: location.path,
      hash: tab
    })
  }, [tab])
  
  return (
    <Box mt={10} mr={[0, 20]}>
      <Tabs
        activeKey={tab}
        onChange={setTab}
        type="card"
        tabPosition={isMobile() ? 'top' : 'left'}
      >
        {/*Main*/}
        <Tabs.TabPane
          tab="Культ Дракона"
          key="main"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">Культ Дракона</Header>
          </Flex>
          
          <Box my={10}>
            <Quote author="Саммастер">
              “...ніщо не вистоїть, крім похилених тронів, в яких замість правителів сидять мертві. Дракони вічно будуть
              правити світом…”
            </Quote>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Містра - богиня магії - не раз удостоювала смертних честі бути своїми Обранцями, але не всі могли
              справитись із великим даром богині. Одним із таких був талановитий чарівник Саммастер. Він багато
              роздумував про роль драконів - цих прекрасних і смертоносних створінь, які з'явилися на Торілі задовго до
              зародження людської раси. І зрештою дійшов висновку, що дракони гідні поклоніння, що саме вони повинні
              правити світом, причому не просто дракони, а мертві дракони! Використовуючи силу, дану йому Містрою,
              Саммастер почав втілювати цю ідею в життя.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Так з’явився Культ Дракона - таємне товариство, що присвятило себе служінню невідворотній владі неживих
              драконів над Фаеруном. Культ займається збором інформації, незаконними оборудками, магічними
              дослідженнями, а також укладає альянси зі злими драконам, аби перетворювати їх у драколічів та поклонятись
              ім.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Символ Культу - вогонь з очима, що горять над кігтями дракона.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Після приходу до влади культиста на ім’я Северин, відбувся внутрішній розкол Культу Дракона на “новий” та
              “старий”.
            </Paragraph>
          </Box>
        
        </Tabs.TabPane>
        {/*Old cult*/}
        <Tabs.TabPane
          tab="“Старий” Культ Дракона"
          key="old_cult"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">“Старий” Культ Дракона</Header>
          </Flex>
    
          <Box my={10}>
            <SecretText>
              Більше інформації після проходження завдання “Тіні над Місячним морем”
            </SecretText>
          </Box>
        </Tabs.TabPane>
        {/*New cult*/}
        <Tabs.TabPane
          tab="“Новий” Культ Дракона"
          key="new_cult"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">“Новий” Культ Дракона</Header>
          </Flex>
          
          <Box my={10}>
            <SecretText>
              Більше інформації після проходження завдання “Чотири пекельні монети”
            </SecretText>
          </Box>
        </Tabs.TabPane>
        {/*Those who speak*/}
        <Tabs.TabPane
          tab="Ti, що Говорять з Драконами"
          key="those_who_speak_with_dragons"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">Ті, що Говорять з Драконами</Header>
          </Flex>
          
          <Box my={10}>
            <SecretText>
              Більше інформації після проходження завдання “Таємниці Туманного Лісу”
            </SecretText>
          </Box>
        </Tabs.TabPane>
        {/*Masks*/}
        <Tabs.TabPane
          tab="Маски Дракона"
          key="masks"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">Маски Дракона </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              П’ять древніх масок у формі голів дракона, кожна створена по подобі кожного з п’яти видів кольорових
              драконів. Їм приписують магічні властивості, але які - невідомо.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <SecretText>
              Більше інформації після проходження завдання “Башня Ксонтала”
            </SecretText>
          </Box>
        </Tabs.TabPane>
        {/*Thay*/}
        <Tabs.TabPane
          tab="Тей"
          key="thay"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">Тей</Header>
          </Flex>
    
          <Box my={10}>
            <Quote author="Мірлана">
              "Зручно винити Тей в усіх бідах. Зручно усім, навіть тейцям"
            </Quote>
          </Box>
    
          <Box my={10}>
            <Paragraph fontSize="16px">
              Для жителів Фаеруна Тей - темна і зла імперія, де жорстокі Червоні Чарівники нескінченно змахують
              батогами,
              де постійно стогнуть раби, і все що їх чекає за віддану працю - перетворення в гидких надприродних
              монстрів.
              Правда відрізняється не набагато.
            </Paragraph>
          </Box>
          <Box my={10}>
            <Paragraph fontSize="16px">
              Вільні тейці потрапляють в один з шести класів: Червоні Чарівники, бюрократи, священики, торговці, солдати
              і
              ремісники або кваліфіковані робітники - лише на крок вище простих рабів.
            </Paragraph>
          </Box>
    
          <Flex column center my={30}>
            <img src={thayParty} alt="Thay party"/>
      
            <Msg>"Кожен теєць знає - майбутнє існує лише в  стражданні ворогів"</Msg>
          </Flex>
    
          <Box my={10}>
            <Paragraph fontSize="16px">
              Тей - нація, керована жорстокими та надзвичайно могутніми чарівниками - зулкірами, які покладаються на
              рабство, щоб забезпечити себе багатством та розкішшю. Зулкіри в свою чергу вибирають тарчіонов земель -
              цивільних губернаторів, керівників мирськими справами царства і службовцями на благо Червоних Чарівників.
            </Paragraph>
          </Box>
          <Box my={10}>
            <Paragraph fontSize="16px">
              Червоні Чарівники голять все волосся на своїй голові (включаючи брови і часто вії) та іноді на всьому
              своєму
              тілі, і більшість сильно татуює себе. Такі татуювання - часто місця магічного зберігання заклять для
              надзвичайного використання (і саме вони є джерелом багатьох «дивних порятунків» ув'язнених тейців).
            </Paragraph>
          </Box>
          <Box my={10}>
            <Paragraph fontSize="16px">
              У Теї лише Червоним Чарівникам дозволяється носити червоний одяг. Їх вчать залізному самоконтролю -
              безмовному підпорядкуванню потужним старшим магам. Однак кожен Чарівник завжди таємно мріє про власну
              світову домінацію.
            </Paragraph>
          </Box>
          <Box my={10}>
            <Paragraph fontSize="16px">
              Влада Червоних Чарівників простягається далеко за межі кордонів Тея. Анклави Червоних Чарівників існують у
              безлічі великих міст всюди в країнах Внутрішнього Моря, змінюючи магічні вироби на товари, багатства і, в
              деяких випадках, рабів з дюжини країн. Тейців широко ненавидять і не довіряють їм, але широкий вибір
              магічних товарів приваблює багатьох покупців, яким байдуже на "етичні норми".
            </Paragraph>
          </Box>
          <Box my={10}>
            <Paragraph fontSize="16px">
              Червоні Чарівники Тею сумно відомі своїми «аморальними» магічними експериментами - але вони були б
              набагато
              більш небезпечні для решти Фаеруна, якби внутрішня боротьба серед їх рядів не була б настільки порочна та
              енергійна. Зулкіри постійно будують плани і змови проти своїх сусідів. А недавно серед них назрів
              серйозний
              конфлікт: не всі задоволені тим, що ліч Сзасс Тем - зулкір Некромантії Тею, де-факто взяв на себе
              керівництво країною. Один з таких - патріот та герой Рат Модар, який покинув Тей, аби заручитись
              підтримкою
              Культу Дракона та покінчити із тиранією Сзасса Тема.
            </Paragraph>
          </Box>
    
          <Box my={10}>
            <Quote author="Звіт Мірлани, Тейського лицаря, вірного воїна Рат Модара"/>
          </Box>
    
          <Box my={20} px={20}>
            <Divider />
          </Box>
    
          <Box my={10}>
            <Paragraph fontSize="16px">
              Тей - віддалена держава на сході Фаеруну, відома своєю непростою історією і погонею за магічними знаннями.
              Зараз Тей знаходиться під контролем ліча Засс Тама, але далеко не всі тейці підтримують такий стан речей.
            </Paragraph>
          </Box>
    
          <Box my={10}>
            <Paragraph fontSize="16px">
              Найвідоміша фракція експатріантів Тею очолена Червоним Чарівником Рат Модаром. Ходять слухи, що вони
              вступили у домовленість з Культом Дракона у пошуку союзників для звільнення свого дому.
            </Paragraph>
          </Box>
          <Box my={10}>
            <Paragraph fontSize="16px">
              Червоних Чарівників у Флані очолює Зарлада - сильний некромант, яка вже не один раз руйнувала плани
              Фракцій.
              Відомо, що вона керується не стільки інтересами Червоних Чарівників, скільки особистими цілями.
            </Paragraph>
          </Box>
          <Box my={10}>
            <Paragraph fontSize="16px">
              Червоні Чарівники часто діють за підтримки у вигляді Тейських Лицарів. Одним з таких лицарів є Мірлана -
              вмілий воїн та лейтенант Зарлади. На відміну від чарівниці, Мірлана є фанатично відданою Рат Модару.
            </Paragraph>
          </Box>
    
          <Box my={10}>
            <Quote author="з архівів Гахала Іммертума, Намісника фракції Альянс Лордів у Флані"/>
          </Box>
  
        </Tabs.TabPane>
      </Tabs>
    </Box>
  )
}

export default CultOfTheDragon
