import React, { useState, useEffect } from 'react'
import { Tabs, List, Alert } from 'antd'
import { Box } from 'noui/Position'
import { Header, Msg } from 'ui/Text'
import { withRouter } from 'react-router-dom'

const RULES = [
  'Якщо це ваша перша гра Ліги Авантюристів - ви починаєте персонажем першого рівня!',
  'Заборонені будь-які evil-алайменти (окрім Lawful Evil для фракцій Жентарім та Альянс Лордів).',
  'Заборонена Unearthed Arcana.',
  'Заборонено PvP (Player versus Player).',
  'Початкові характеристики - лише через Standart Array (15, 14, 13, 12, 10, 8) або ж Point Buy.',
  'Генерування персонажів відбуваються по принципу PHB +1, тобто використовувати можна Книгу Гравця + ще одну книгу на вибір (Elemental Evil Player’s Companion, Volo’s Guide to Monsters, Xanathar’s Guide to Everything, Sword Coast Adventurer’s Guide, Mordenkainen’s Tome of Foes). Посилання на Книгу Гравця - [тут](https://dungeonsanddragons.ru/bookfull/5ed/5e%20Players%20Handbook%20-%20%D0%9A%D0%BD%D0%B8%D0%B3%D0%B0%20%D0%B8%D0%B3%D1%80%D0%BE%D0%BA%D0%B0%20RUS.pdf)',
  'Жодних рас/класів, які мають властивість “Політ”.',
  'Ваші стартові предмети описані в Книзі Гравця. Ви завжди берете стартові цифри, не використовуючи модифікатори кидка кубика.',
  'При отриманні нового рівня ви отримуєте середнє значення здоров’я, не через кидок кубика.',
  'Усі очки досвіду (ХР), золота та предмети, які ви отримуєте під час завершення завдання в Лізі Авантюристів переходять з вами в інші пригоди Ліги. Записуйте усі надходження. Золото та досвід ЗАВЖДИ ділиться порівну між усіма гравцями. Магічні предмети отримують ті, хто їх ще немає.',
  'За виконання квестів ви будете отримувати ДП (Дні Простою). Що воно таке і як його витрачати описано нижче.',
  'Між сесіями ви можете витрачати своє золото на купівлю предметів з Книги Гравця.',
  'ВАЖЛИВО! Між сесіями Ліги Авантюристів ви можете змінювати раси і класи, для того щоб підібрати собі героя до смаку. Однак ваші предмети зберігаються, очки досвіду зберігаються і, НАЙВАЖЛИВІШЕ, ім’я персонажа - також зберігається. Однак це можливо лише до 4 рівня включно!',
  'По ходу сюжету у вас буде можливість приєднатись до однієї із фракцій Флану та отримати ряд вагомих переваг. Але будьте уважні - зробивши вибір, змінити його уже не вийде. Опис усіх фракцій - [тут](https://dungeonsanddragons.ru/bookfull/AL_Faction_Guide_RUS.pdf)',
]

const DEATH_OPTIONS = [
  'Якщо тіло мертвого можна повернути в місто, і всі його важливі органи знаходяться на місці, гравець може заплатити 1250 золотих зі своїх запасів, щоб заплатити нейтральному клірику за закляття raise dead.',
  'Якщо в мертвого немає грошей, група може скинутись і воскресити товариша спільними коштами. Група не зобов’язана це робити, а персонаж не зобов’язаний повертати кошти.',
  'Якщо персонаж 1-4 рівня і є членом однієї із фракцій, представник фракції може воскресити свого представника. Ця опція доступна лише на 1-4 рівні. Більше того, в такому випадку персонаж втрачає всі ХР, золото та предмети отримані під час поточної сесії, і не може перегравати цю пригоду.',
]

const Help = ({ history, location }) => {
  const [tab, setTab] = useState(location.hash.substring(1) || 'the_death')

  useEffect(() => {
    history.push({
      path: location.path,
      hash: tab
    })
  }, [tab])

  return (
    <Box>
      <Tabs
        activeKey={tab}
        onChange={setTab}
        type="card"
        tabPosition="left"
      >
        <Tabs.TabPane tab="The Rules" key="the_rules">
          <Box my={10}>
            <Header>Правила Ліги Авантюристів</Header>
          </Box>

          <List
            size="large"
            bordered
            dataSource={RULES}
            renderItem={item => (<List.Item>{item}</List.Item>)}
          />
        </Tabs.TabPane>

        <Tabs.TabPane tab="The Death" key="the_death">
          <Box my={10}>
            <Header>Смерть персонажа</Header>
          </Box>

          <Box mb={10}>
            <Msg>
              Трапляється так, що небезпека виявляється занадто серйозною і один або кілька персонажів помирають під
              час виконання завдання. Ось як можна вийти із такої ситуації:
            </Msg>
          </Box>

          <List
            size="large"
            bordered
            dataSource={DEATH_OPTIONS}
            renderItem={item => (<List.Item>{item}</List.Item>)}
          />

          <Alert
            message="Важливо! "
            description="В усіх випадках вище, використовується закляття raise dead. Персонаж отримує -4 штраф на кидки атаки, спаскидки та перевірки навиків. Штраф зменшується на -1 за кожен довгий відпочинок. Між завданнями можна витрачати дні простою, щоб “проспати” цей штраф."
            type="info"
            showIcon
          />

          <Box my={20}>
            <Alert
              description="Якщо жоден з варіантів не підходить, прийдеться створювати нового персонажа 1-го рівня. Такий персонаж немає жодних переваг від свого попередника, оновлює ім’я та може заново проходити попередньо зіграні пригоди."
              type="error"
            />
          </Box>

        </Tabs.TabPane>

        <Tabs.TabPane
          tab="Downtime Activities"
          key="downtime_activities"
        >
          Content of Tab Pane 3
        </Tabs.TabPane>
      </Tabs>
    </Box>
  )
}


export default withRouter(Help)