import React, { useEffect, useState } from 'react'
import { Tabs } from 'antd'
import { Box, Flex } from 'noui/Position'
import { Header, Quote, Paragraph, SecretText } from 'ui/Text'
import { isMobile } from 'noui/MediaQuery'

const Phlan = ({history, location}) => {
  const [tab, setTab] = useState(location.hash.substring(1) || 'main')
  
  useEffect(() => {
    history.replace({
      path: location.path,
      hash: tab
    })
  }, [tab])
  
  return (
    <Box mt={10} mr={[0, 20]}>
      <Tabs
        activeKey={tab}
        onChange={setTab}
        type="card"
        tabPosition={isMobile() ? 'top' : 'left'}
      >
        <Tabs.TabPane
          tab="Головна"
          key="main"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Флан
            </Header>
          </Flex>
          
          <Box my={10}>
            <Quote author="табличка над барною стійкою таверни “Гоблін, що Сміється”">
              “Суворі землі народжують сильних людей”
            </Quote>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Флан, заснований в 367 ЛД, втілює собою непохитність людей і їх прагнення приносити цивілізацію в дикі
              місця. З моменту заснування, місто багато разів розносили на шматки, але воно відроджувалось як фенікс з
              власного попелища. Однак це сказалось на місцевій архітектурі: Флан буквально стоїть на власних руїнах, а
              в підвалах будинків можна зустріти спуски в древні катакомби.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Будучи одним із важливих портових міст на березі Місячного Моря, Флан опинився в скрутному становищі, коли
              помер Лорд-Протектор Анівар Даоран. До влади прийшов Ектор Брамс - начальник ордену Чорних Кулаків,
              військової організації, що існувала у Флані десятиліттями. Будучи хорошим військовим, але поганим
              політиком, Ектор Брамс пішов простим шляхом та об’явив військовий стан в місті та околицях.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Чорні Кулаки взяли владу у місті, тримаючи усіх в страху та порядку. Торгівля у Флані майже зупинились,
              гільдії почали боротись за контроль над містом, аби компенсувати втрату доходів. Заробітна плата різко
              впала, ціни на товари та послуги стрімко ростуть. З кожним днем, все більше тіл розгойдується на
              Стояновський воротах. Флан, де нині панує беззаконня, являє собою лише жалюгідну тінь того, чим він був
              раніше.
            </Paragraph>
          </Box>
        
        </Tabs.TabPane>
        
        <Tabs.TabPane
          tab="Чорні Кулаки"
          key="black_fists"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">Чорні Кулаки</Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Військова організація Флану під командуванням командора Ектора Брамса. Маючи коріння в культі Бейна, Чорні
              Кулаки обірвали всі формальні зв'язки десятиліття тому, проте вони все ще словесно шанують Бейна.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Після того як Ектор Брамс став Лордом-Регентом Флану, Чорні Кулаки почали відповідати за підтримання
              порядку і дисципліни у Флані. Через вакуум влади, лицарі Чорного Кулака отримали повноваження виступати
              одночасно в якості судді, присяжних і ката. Їх суд швидкий і суворий, за що громадяни Флана їх бояться та
              ненавидять.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Нижні чини ордена наскрізь корумповані, і хабарництво та знущання є звичайним явищем. Саме небажання
              Чорних Кулаків займатись своїми обов’язками і спричинило притік авантюристів у Флан: заплатити найманцям
              за виконання роботи виявилось ефективніше аніж чекати допомоги міської варти.
            </Paragraph>
          </Box>
        
        </Tabs.TabPane>
        
        <Tabs.TabPane
          tab="Сльози Злоби"
          key="tears_of_virulence"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">Сльози Злоби</Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Хоч вельмишановний Лорд-Регент Ектор Брамс і мав у власних інтересах збереження безпеки у місті, не усі
              його підлеглі поділяли цей порив.
            </Paragraph>
          </Box>
          <Box my={10}>
            <Paragraph fontSize="16px">
              Коли Ворганшакс, Понівечена Злоба, та його приспішники-культисти захопили Флан, багато колишніх Чорних
              Кулаків переметнулись на сторону нападників, жадаючи зберегти свій владний статус. Ці зрадники зараз
              відомі під іменем Сліз Злоби та підтримують тиранічний режим, встановлений Культом Дракона.
            </Paragraph>
          </Box>
          <Box my={10}>
            <Paragraph fontSize="16px">
              Більшість з їхнього числа - добре озброєні воїни, багато хто - ще й досвідчені. Вони - залізний кулак на
              пульсі міста, і ті, з ким ви стикатиметесь частіше всього. Впізнати їх можна за яскраво-зеленою символікою
              у вигляді каплі, що вкриває їх безчесні чорні мундири.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Quote author="з архівів Гахала Іммертума, Намісника фракції Альянс Лордів у Флані"/>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Сльози Злоби зберегли усі навички Чорних Кулаків. Ті ж манери допитів, та ж ненависть, те ж бажання робити
              все чужими руками. Їх багато, вони добре озброєні, у них є тактика, відточена роками. Але Культ потребує
              покори та гарматного м’яса, тому Сльози Злоби набирають до себе усіх: садистів, ображених та “патріотів”
              із промитими мізками. Секрет успішного протистояння з цими загонами - це знищення командування. Без
              командира Сльози Злоби перетворюються на звичайних головорізів.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Але як не всі Чорні Кулаки були корумповані, так не всі з них підтримали режим Ворганшакса. Такі особи як
              Алейд Буррал чи Джесаїл Грейкастл можуть бути цінними союзниками, які допоможуть переманити тих Чорних
              Кулаків, які коливаються.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Quote author="з доповіді мисливця Гастона"/>
          </Box>
        </Tabs.TabPane>
        
        <Tabs.TabPane
          tab="Крон Болвер"
          key="cron_bolver"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">Крон Болвер</Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Не дивлячись на свою молодість, лицар-лейтенант Болвер є успішним лідером. Він харизматичний та вселяє
              впевненість у своїх підлеглих. Однак, він звик до розкоші, і знає, що за це потрібно платити. Тому будучи
              правою рукою Ектора Брамса, Крон Болвер успішно маніпулював інформацію задля власної вигоди.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              З приходом до влади Культу Дракона, лейтенант пішов вгору по кар’єрній драбині, спершу очоливши Сльози
              Злоби, а згодом і ставши де-факто Намісником Флану. Однак всередині він так і залишився спраглим до наживи
              гімнюком
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Quote author="з доповіді мисливця Гастона"/>
          </Box>
        </Tabs.TabPane>
        
        <Tabs.TabPane
          tab="Червоні Чарівники Флану"
          key="red_wizards"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">Червоні Чарівники Флану</Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Я лише кілька раз бачив Червоних Чарівників в дії. В червоних шатах, лисі, татуйовані, мовчазні. Вони
              працюють групами, по три чаклуна мінімум. Поки один виманює на себе противника, інші двоє знаходяться
              поруч, невидимі, готові або метнути гігантські вогняні кулі, або ж паралізувати суперників. Або ж і те, і
              інше. Деколи вони викликають мертвих собі на допомогу, оточуючи суперників, щоб шпурнути кулю вогню в
              натовп. Майже завжди вони супроводжують високопосадовців Культу чи важливі вантажі. Або ж беруть участь в
              каральних операціях, де цілять вогняними кулями в противників, ігноруючи жертви серед союзників. Мені
              інколи здається, що вони їм просто подобається метати вогняні кулі.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Я знаю, що Культ Дракона також має чаклунів, але Червоні, як їх називають Сльози Злоби, це зовсім інший
              рівень. Якщо ви не можете вбити їх першими - тікайте.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Quote author="з доповіді мисливця Гастона"/>
          </Box>
        </Tabs.TabPane>
        
        <Tabs.TabPane
          tab="Ворганшакс, Понівечена Злоба"
          key="green_dragon"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">Ворганшакс</Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Ворганшакс - це дорослий зелений дракон, майже що древній, чий величезний розмір перевершує лише ще більш
              величезне его. Незважаючи на жорстоку травму, у вигляді покаліченого і порваного крила, залишену йому
              бронзовим драконом ще в ті часи, коли він був вірмлінгом, Ворганшакс все одно справляє дуже сильне
              враження. Він достатньо великий та сильний, навіть в порівнянні з іншими драконами. В результаті травми та
              розміру, він досить незграбний літун, проте жахливо руйнівний
              на землі.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Ворганшакс є породженням древнього зеленого дракона Клагелеуматар, що править в лісі Криптенгарден далеко
              на заході. У якості помсти фракціям Фаеруну за події в її лісі, вона позичила (хоча скоріше продала)
              допомогу Ворганшакса Культу Дракона.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              У Ворганшакса є величезна кількість кобольдов, дракононароджених та напівдраконів, які фанатично віддані
              йому, багато з них володіють знаннями потужної магії.
            </Paragraph>
          </Box>
        </Tabs.TabPane>
      </Tabs>
    </Box>
  )
}

export default Phlan
