import React, { useEffect, useState } from 'react'
import { Alert, Tabs } from 'antd'
import { Box, Flex } from 'noui/Position'
import { Header, SecretText, Paragraph } from 'ui/Text'
import { isMobile } from 'noui/MediaQuery'
import Portrait from 'ui/Portrait'
import tyranny1Cover from './shared/tyranny1.jpg'
import tyranny2Cover from './shared/tyranny2.jpg'
import tyranny3Cover from './shared/tyranny3.jpg'
import drums1Cover from './shared/drums1.jpg'
import swamp1Cover from './shared/swamp1.jpg'

const Storyline = ({history, location}) => {
  const [tab, setTab] = useState(location.hash.substring(1) || 'main')
  
  useEffect(() => {
    history.replace({
      path: location.path,
      hash: tab
    })
  }, [tab])
  
  return (
    <Box mt={10} mr={[0, 20]}>
      <Tabs
        activeKey={tab}
        onChange={setTab}
        type="card"
        tabPosition={isMobile() ? 'top' : 'left'}
      >
        {/*Головна*/}
        <Tabs.TabPane
          tab="Основна сюжетна лінія"
          key="main"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">Основна сюжетна лінія</Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              “Тиранія Драконів” - це перший сезон ігрових сесій Ліги Авантюристів. Сюжет історії крутиться навколо
              загадкового Культу Дракона та рядового портового містечка Флан.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Усі історії викладені тут - пройдені та пережиті гравцями “Прямої Гільдії” в період з 2018 по 2019 рік.
              Містять певні розходження із офіційним першим сезоном Ліги Авантюристів.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Alert message="Будьте уважні: присутні спойлери!" type="error"/>
          </Box>
        </Tabs.TabPane>
        {/*Кошенята*/}
        <Tabs.TabPane
          tab="Кошенята маєтку Ковель"
          key="kitties"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">Основна сюжетна лінія</Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Альянс Лордів наймає авантюристів для небезпечного завдання: прибути у Флан та вбити одіозного чарівника
              на ім’я Денлор.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <SecretText>
              Більше інформації після проходження завдання “Кошенята маєтку Ковель”
            </SecretText>
          </Box>
        </Tabs.TabPane>
        {/*Глістер*/}
        <Tabs.TabPane
          tab="Дорога на Глістер"
          key="glister"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Дорога на Глістер
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Відновлення роботи мідних шахт в Глістері породило зацікавленість в торговців Мельваунту. Багато хто
              вкладає гроші в розробку родовищ, сподіваючись що там де є мідь - буде й золото. Група авантюристів
              погоджується супроводити караван із шахтарським приладдям, ще не усвідомлюючи істинних наслідків цього
              "легкого заробітку"....
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <SecretText>
              Більше інформації після проходження завдання “Дорога на Глістер”
            </SecretText>
          </Box>
        </Tabs.TabPane>
        {/*Проблеми*/}
        <Tabs.TabPane
          tab="Проблеми Флану"
          key="problems"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Проблеми Флану
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Флан - це портове містечко на березі Місячного Моря, де панує беззаконня та свавілля угрупування на ім’я
              Чорні Кулаки. Місцеві жителі все частіше стикаються із незгодами, які не хоче вирішувати місцева влада. Це
              “золотий час” для авантюристів, адже проблем у Флані багато, а платять за них добре.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <SecretText>
              Більше інформації після проходження завдання “Проблеми Флану”
            </SecretText>
          </Box>
        </Tabs.TabPane>
        {/*Сокіл*/}
        <Tabs.TabPane
          tab="Таємниці фортеці Сокіл"
          key="sokil"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Таємниці фортеці Сокіл
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Фортеця Сокіл уже давно не виконує свою першочергову функцію. Однак вона досі є важливим важелем на
              політичній арені Флану. Коли місцевий гарнізон раптово пропадає, в повітрі пахне неприємностями. І
              древніми прокляттями…
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <SecretText>
              Більше інформації після проходження завдання “Таємниці фортеці Сокіл”
            </SecretText>
          </Box>
        </Tabs.TabPane>
        {/*Тіні*/}
        <Tabs.TabPane
          tab="Тіні над Місячним морем"
          key="shadows"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Тіні над Місячним морем
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Життя біля Місячного Моря ніколи не було легким. Бандити, пірати та жорстокі лорди правлять цими землями,
              ускладнюючи життя усім, хто хоче жити чесно. Але недавно з'явилась нова проблема: корабель-привид атакує
              прибережні селища. Ті, кому пощастило вижити, безумно шепочуть про "око драколіча"...
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <SecretText>
              Більше інформації після проходження завдання “Тіні над Місячним морем”
            </SecretText>
          </Box>
        </Tabs.TabPane>
        {/*Криптенгарден*/}
        <Tabs.TabPane
          tab="Гниль Криптенгардена"
          key="cryptogarden"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Гниль Криптенгардена
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Фракції Фаеруну дізнались про розміщення древнього артефакту. А значить прийшов час об’єднати зусилля,
              зібрати війська і рушити в глибину містичного лісу Криптенгарден та кинути виклик його господарю -
              древньому дракону Клагелеуматар.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <SecretText>
              Більше інформації після проходження завдання “Тіні над Місячним морем”
            </SecretText>
          </Box>
        </Tabs.TabPane>
        {/*Данина*/}
        <Tabs.TabPane
          tab="Данина мертвим"
          key="tribute"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Данина мертвим
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Орден Келемвора давно опікується мертвими, відправляючи їх в останню путь та упокоюючи на Валінгенському
              кладовищі. Але недавно серед кілька послушників було знайдено вбитими, частково з’їдженими. А тому
              настоятель ордену, Провідник Мертвих Йовір Глендон, звертається за допомогою.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Досліджуючи катакомби Валінгенського кладовища разом із послушницею Кассіт, авантюристи знаходять причину
              надзвичайної активності мертвих - Червоного Чарівника на ім’я Роррет. Правда, некромант швидко
              телепортується геть, залишивши замість себе зомбі, кобольтів та Тейського лицаря на ім’я Мірлана.
            </Paragraph>
          </Box>
  
          <Portrait
            src={swamp1Cover}
            alt="гул 1"
            my={30}
          />
  
          <Box my={10}>
            <Paragraph fontSize="16px">
              Перемігши посіпак Роррета, авантюристи дізнаються про причину його перебування тут. Культ Дракона планував
              використати некромантію, аби підняти армію мертвих і захопити Флан. Також були знайдена карта міста із
              обведеним замком Вальєво та підписом “Сяюче Озеро”
            </Paragraph>
          </Box>
        </Tabs.TabPane>
        {/*Вшанування вогню*/}
        <Tabs.TabPane
          tab="Вшанування вогню"
          key="fire"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Вшанування вогню
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              В давно покинутих руїнах Гір Драконячого Шпиля було помічено культистів та їхніх приспішників-кобольтів.
              По слухах, вони шукають подарунок для дракона, що живе в регіоні. Нащо їм це потрібно - невідомо, але
              нічого хорошого жителям Флану це точно не принесе.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <SecretText>
              Більше інформації після проходження завдання “Вшанування вогню”
            </SecretText>
          </Box>
        </Tabs.TabPane>
        {/*Крадій свитків*/}
        <Tabs.TabPane
          tab="Крадій свитків"
          key="scrolls_thief"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Крадій свитків
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Площа Школяра - досить тихенький район Флану, але серія загадкових крадіжок стурбувала владних осіб в
              цьому районі. Вони не довіряють Чорному Кулаку, а тому їм потрібні "незалежні експерти"...
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <SecretText>
              Більше інформації після проходження завдання “Крадій свитків”
            </SecretText>
          </Box>
        </Tabs.TabPane>
        {/*Гул барабанів*/}
        <Tabs.TabPane
          tab="Гул барабанів"
          key="drums"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Гул барабанів
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Останні кілька днів вітер приносить з Сутінкового Болота гул барабанів. Кожного ранку із ферм неподалік
              хтось пропадає, і лише розмиті сліди ведуть кудись до води. Жителі околиць стурбовані, а тому звертаються
              за допомогою до авантюристів.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Дослідження розграбованих ферм та пошуки слідів приводять до ящеролюдів, які стоять за цими викраденнями.
              Під шум барабанів вони крадуться околицями та беруть в полон сильних людей і тварин, а потім транспортують
              їх в своє лігво. І роблять це не просто так, а як дар своєму новому вождю.
            </Paragraph>
          </Box>
          
          <Portrait
            src={drums1Cover}
            alt="гул 1"
            my={30}
          />
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Місяць тому чорний дракон на ім’я Тростульграель покинув своє лігво біля Мулмастера, аби захопити
              Сутінкове Болото. Він підкорив собі три племені ящеролюдів та вбив їхнього короля. Тростульграель зажадав,
              аби племена змагались за його прихильність та приносили йому в данину гуманоїдів та звірів. Тому, хто
              принесе найкращу здобич, дракон дарує можливість бути його замісником.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Однак Топекоготь, син короля ящерів, вирішив перехопити владу. Користуючись відсутністю дракона, він
              влаштував велику бійку, аби перебити вождів усіх племен. Користуючись хаосом, авантюристам вдалось
              звільнити викрадених та втекти.
            </Paragraph>
          </Box>
        </Tabs.TabPane>
        {/*Історії*/}
        <Tabs.TabPane
          tab="Історії, розказані деревами"
          key="tales"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Історії, розказані деревами
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Колись давно ельфи і люди заключили союз: ельфи захищають Флан від небезпек, а люди не заходять в
              Сутінковий Ліс. Однак зникнення місцевого жителя може похитнути давню співпрацю. Проведіть розслідування
              та залучіться допомогою фей, щоб захистити Флан.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <SecretText>
              Більше інформації після проходження завдання “Історії, розказані деревами”
            </SecretText>
          </Box>
        </Tabs.TabPane>
        {/*Бандити*/}
        <Tabs.TabPane
          tab="Бандити Залізного шляху"
          key="iron_route"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Бандити Залізного шляху
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Залізний Шлях - друга, після Фланського Тракту, важлива торгівельна дорога Флану. Однак і там неспокійно.
              Між двома бандами розгорнулась війна за контроль територій, від якої страждають і купці, і Флан. Групою
              найманців, що перетворились в бандитів, керує колишній офіцер Чорного Кулаку, а на чолі дикунів з півночі
              стоїть драконорождена чарівниця. Нанесіть удар у відповідь та покінчіть із бандами раз і назавжди!
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <SecretText>
              Більше інформації після проходження завдання “Бандити Залізного шляху”
            </SecretText>
          </Box>
        </Tabs.TabPane>
        {/*Тиранія*/}
        <Tabs.TabPane
          tab="Тиранія Флану"
          key="tyranny"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Тиранія Флану
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Все змінюється у Флані, і при тому - в гіршу сторону. В регіоні навколо частішають сутички із орками та
              кобольтами, в кожній кримінальній справі виявляється замішана якась третя сторона. Лицар-Командор Ектор
              Брамс, Лорд Регент Флан, вирішив нарешті розібратись із цією проблемою. Він не політик, а воїн, і досить
              довго заплющував очі на свавілля своїх підлеглих, Чорних Кулаків, а також на проблеми міста. Тому Ектор
              Брамс збирає секретну зустріч усіх голів гільдій та впливових дворян, аби спільними зусиллями придумати
              спільний план розвитку Флану. На зустрічі має бути Айя Гленмір - ексцентрична ельфійська чарівниця, але
              вона запізнюється.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Тим часом Алейд Буррал знову потребує допомоги авантюристів. Культист Спернік - один із ключових доказів,
              що за дивними подіями у Флані стоїть Культ Дракона. Його тримають в тюрмі на Воротах Стоянов. От тільки
              суд на ним все ніяк не може відбутись. Більше того, в його камеру постійно ходять якісь особи, та й
              культист все менше і менше нагадує в’язня. Алейд потребує доказів корумпованості Чорних Кулаків, для того,
              щоб презентувати їх на сьогоднішній таємній нараді Лорда Регента. Варто тільки авантюристам погодитись на
              цю справу, як ситуація кардинально змінюється - величезний зелений дракон на ім’я Ворганшаракс влітає у
              Флан. Своїм руйнівним диханням він перетворює Валінгенський цвинтар на кислотне болото, знищивши храм
              Келемвора та усіх послушників. Далі дракон нападає на замок Вальєво, розламуючи стіни та вбиваючи усіх,
              хто зібрався на секретну нараду Ектора Брамса.
            </Paragraph>
          </Box>
          
          <Portrait
            src={tyranny1Cover}
            alt="тиранія 1"
            my={30}
          />
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Вискочивши на вулицю авантюристи стають свідками хаосу - армія Культу Дракона захоплює Флан, виходячи з
              каналізаційних тунелів та з прихованих кораблів. Виявляється, підготовка до цієї атаки велась не один
              тиждень: культисти та їхні послідовники невеликими групами прибували у Флан на кораблях та ховались в
              покинутих складах, чекаючи сигналу.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              У вуличних сутичках загинув Маркот, він же Товстий Мар, офіціант з таверни “Гоблін, що Сміється”. Зате
              вдалось звільнити полонену Айю Гленмір, яка розповіла - через її запізнення лорд Ектор Брамс не потрапив
              на власну секретну зустріч, а тому він досі може бути живим. Це надихнуло Алейд Буррал на план по
              звільненню свого командира. За підтримки злочинців Вітаючих, які швидко перекваліфікувались в народних
              героїв, та дівчинки Елісандри з її сліпою козою, що невідомо як опинилась у Флані, була проведена атака на
              Ворота Стоянов - місце, де культисти тримали полонених як данину для дракона. Алейд Буррал пожертвувала
              своїм життя, відволікаючи Сльози Злоби - колишніх Чорних Кулаків, що перейшли на сторону нападників. Це
              дало можливість авантюристам врятувати Лорда Регента.
            </Paragraph>
          </Box>
          
          <Portrait
            src={tyranny2Cover}
            alt="тиранія"
            my={30}
          />
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Опісля агенти Арфістів проникли у в’язничний комплекс та вбили Сперніка - виявилось, що саме він
              координував атаку дракона на замок. За допомогою Альянсу Лордів та Кассіт, єдиної вижившої послушниці
              Келемвора, авантюристи виводять врятованих людей з Флану, лише щоб бути атакованою Іксусаксою - лідером
              Культу Дракона у Флані.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Втікачам вдалось відбити цю атаку, однак в бою гине Ектор Брамс, Лорд Регент Флану. Його тіло, разом із
              тілом Алейд Буррал, транспортують до Мулмастера, в надії на воскресіння.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Хоча вдалось звільнити значну частину мешканців Флану, саме місто опинилось під тиранією Ворганшаракса та
              Культу Дракона. Тим, кому не було куди тікати, прийшлось змиритись життям в постійному страху та
              жорстокості. Або організувати рух повстання.
            </Paragraph>
          </Box>
          
          <Portrait
            src={tyranny3Cover}
            alt="тиранія"
            my={30}
          />
        
        </Tabs.TabPane>
        {/*Вежа*/}
        <Tabs.TabPane
          tab="Вежа Денлора"
          key="denlor_tower"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Вежа Денлора
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Більше сотні років тому у Флані жив могутній чарівник на ім’я Денлор. Він зник за дивних обставин,
              залишивши по собі лише вежу, запечатану невідомою магією. І ось нарешті прийшов час дізнатись, що
              знаходиться за її дверима.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <SecretText>
              Більше інформації після проходження завдання “Острів Десяти”
            </SecretText>
          </Box>
        </Tabs.TabPane>
        {/*Острів10*/}
        <Tabs.TabPane
          tab="Острів Десяти"
          key="island_10"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Острів Десяти
            </Header>
          </Flex>
        </Tabs.TabPane>
        {/*Мародери*/}
        <Tabs.TabPane
          tab="Мародери Сутінкового болота"
          key="swamp"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Мародери Сутінкового болота
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Шпигуни фракцій донесли - в глибинах Сутінкового Болота знайдено лігво чорного дракона. І там не лише
              скарби, а й таємниці, які можуть похитнути баланс сил у Флані. Поки дракон спалює села в околицях, час
              грабувати його лігво!
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <SecretText>
              Більше інформації після проходження завдання “Мародери Сутінкового болота”
            </SecretText>
          </Box>
        </Tabs.TabPane>
        {/*Піраміда*/}
        <Tabs.TabPane
          tab="Темна піраміда Острову Чаклуна"
          key="dark_pyramid"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Темна піраміда Острову Чаклуна
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Давно покинута піраміда на Острові Чаклуна з недавнього часу виділяє магічну енергію, що змінює істот та
              землю навколо себе. Культ Дракона зауважив це та відправляє експедицію, аби захопити цю дивну силу.
              Потрібно випередити їх та не дозволити таємницям піраміди потрапити в погані руки!
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <SecretText>
              Більше інформації після проходження завдання “Темна піраміда Острову Чаклуна”
            </SecretText>
          </Box>
        </Tabs.TabPane>
        {/*Повстанці*/}
        <Tabs.TabPane
          tab="Повстанці Флану"
          key="phlan_rebels"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Повстанці Флану
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Культ Дракона прийшов до влади у Флані. І хоча керівництво усіх фракцій було знищено, віддані агенти не
              померли. Вони зачаїлись, аби власними силами відбудувати те, що знищено, та в партизанській боротьбі, крок
              за кроком, зробити найголовніше - повернути своє місто!
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Це ваша історія, яка твориться саме зараз!
            </Paragraph>
          </Box>
        </Tabs.TabPane>
        {/*Рада*/}
        <Tabs.TabPane
          tab="Рада Вотердіпу"
          key="council"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Рада Вотердіпу
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Дивні культисти вбивають невинних та забирають усе золото. А допомагають їм у цьому дракони. Фракції
              Фаеруну відкинули чвари заради спільної мети - зрозуміти що задумав Культ Дракона і зупинити їх.
            </Paragraph>
          </Box>
        </Tabs.TabPane>
        {/*Відродженя*/}
        <Tabs.TabPane
          tab="Відродження Сяючого Озера"
          key="pool"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Відродження Сяючого Озера
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Про древнє Сяюче Озеро ходить багато легенд. Що воно дарує вічне життя, що воно вміє воскрешати, що воно -
              джерело безграничної магії. Невідомо, що з цього правда, але Культ Дракона не даремно обрав Флан для свого
              нападу: колись під замком знаходилось те саме Сяюче Озеро. І нарешті прийшов час відродити його.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <SecretText>
              Більше інформації після проходження завдання “Одного разу у серпні”
            </SecretText>
          </Box>
        </Tabs.TabPane>
        {/*Твроє проти зла*/}
        <Tabs.TabPane
          tab="Троє проти зла"
          key="three_versus_evil"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Троє проти зла
            </Header>
          </Flex>
          
          <Box my={10}>
            <SecretText>
              Більше інформації після проходження завдання “Втеча з Флану”
            </SecretText>
          </Box>
        </Tabs.TabPane>
        {/*Фінал*/}
        <Tabs.TabPane
          tab="**фінал сезону**"
          key="end_game"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Фінал сезону
            </Header>
          </Flex>
          
          <Box my={10}>
            <SecretText>
              Більше інформації після проходження усіх завдань основної сюжетної лінії
            </SecretText>
          </Box>
        </Tabs.TabPane>
      </Tabs>
    </Box>
  )
}

export default Storyline
