import React, { useEffect, useState } from 'react'
import { Tabs } from 'antd'
import { Box } from 'noui/Position'
import styled from 'styled-components'

const Pre = styled.pre`
 white-space: pre-wrap;       /* css-3 */
 white-space: -moz-pre-wrap;  /* Mozilla, since 1999 */
 white-space: -pre-wrap;      /* Opera 4-6 */
 white-space: -o-pre-wrap;    /* Opera 7 */
 word-wrap: break-word;       /* Internet Explorer 5.5+ */
`

const Thay = ({ history, location }) => {
  const [tab, setTab] = useState(location.hash.substring(1) || 'main')
  
  useEffect(() => {
    history.push({
      path: location.path,
      hash: tab
    })
  }, [tab])
  
  return (
    <Box>
      <Tabs
        activeKey={tab}
        onChange={setTab}
        type="card"
        tabPosition="left"
      >
        <Tabs.TabPane
          tab="Головна"
          key="main"
        >
          <Pre>
            Тей
  
            "Зручно винити Тей в усіх бідах. Зручно усім, навіть тейцям"
            Мірлана
  
            Для жителів Фаеруна Тей - темна і зла імперія, де жорстокі Червоні Чарівники нескінченно змахують батогами, де постійно стогнуть раби, і все що їх чекає за віддану працю - перетворення в гидких надприродних монстрів. Правда відрізняється не набагато.
            Вільні тейці потрапляють в один з шести класів: Червоні Чарівники, бюрократи, священики, торговці, солдати і ремісники або кваліфіковані робітники - лише на крок вище простих рабів.
  
            Тей - нація, керована жорстокими та надзвичайно могутніми чарівниками - зулкірами, які покладаються на рабство, щоб забезпечити себе багатством та розкішшю. Зулкіри в свою чергу вибирають тарчіонов земель - цивільних губернаторів, керівників мирськими справами царства і службовцями на благо Червоних Чарівників.
  
            Червоні Чарівники голять все волосся на своїй голові (включаючи брови і часто вії) та іноді на всьому своєму тілі, і більшість сильно татуює себе. Такі татуювання - часто місця магічного зберігання заклять для надзвичайного використання (і саме вони є джерелом багатьох «дивних порятунків» ув'язнених тейців).
  
            У Теї лише Червоним Чарівникам дозволяється носити червоний одяг. Їх вчать залізному самоконтролю - безмовному підпорядкуванню потужним старшим магам. Однак кожен Чарівник завжди таємно мріє про власну світову домінацію.
  
            Влада Червоних Чарівників простягається далеко за межі кордонів Тея. Анклави Червоних Чарівників існують у безлічі великих міст всюди в країнах Внутрішнього Моря, змінюючи магічні вироби на товари, багатства і, в деяких випадках, рабів з дюжини країн. Тейців широко ненавидять і не довіряють їм, але широкий вибір магічних товарів приваблює багатьох покупців, яким байдуже на "етичні норми".
  
            Червоні Чарівники Тею сумно відомі своїми «аморальними» магічними експериментами - але вони були б набагато більш небезпечні для решти Фаеруна, якби внутрішня боротьба серед їх рядів не була б настільки порочна та енергійна. Зулкіри постійно будують плани і змови проти своїх сусідів. А недавно серед них назрів серйозний конфлікт: не всі задоволені тим, що ліч Сзасс Тем - зулкір Некромантії Тею, де-факто взяв на себе керівництво країною. Один з таких - патріот та герой Рат Модар, який покинув Тей, аби заручитись підтримкою Культу Дракона та покінчити із тиранією Сзасса Тема.
  
            Звіт Мірлани, Тейського лицаря, вірного воїна Рат Модара

          </Pre>
        </Tabs.TabPane>
    
        <Tabs.TabPane
          tab="Рат Модар"
          key="rath_modar"
        >
        </Tabs.TabPane>
    
        <Tabs.TabPane
          tab="Зарлада"
          key="zarlada"
        >
        
        </Tabs.TabPane>
      </Tabs>
    </Box>
  )
}

export default Thay
