import React, { useEffect, useState } from 'react'
import { Tabs, Divider } from 'antd'
import { Box, Flex } from 'noui/Position'
import { Header, Quote, Paragraph, Msg, SecretText } from 'ui/Text'
import { isMobile } from 'noui/MediaQuery'
import thayParty from './shared/party.jpeg'
import rathPortrait from './shared/rath.jpeg'
import zarladaPortrait from './shared/zarlada.jpg'

const Thay = ({history, location}) => {
  const [tab, setTab] = useState(location.hash.substring(1) || 'main')
  
  useEffect(() => {
    history.replace({
      path: location.path,
      hash: tab
    })
  }, [tab])
  
  return (
    <Box mt={10} mr={[0, 20]}>
      <Tabs
        activeKey={tab}
        onChange={setTab}
        type="card"
        tabPosition={isMobile() ? 'top' : 'left'}
      >
        <Tabs.TabPane
          tab="Головна"
          key="main"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">Тей</Header>
          </Flex>
          
          <Box my={10}>
            <Quote author="Мірлана">
              "Зручно винити Тей в усіх бідах. Зручно усім, навіть тейцям"
            </Quote>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Для жителів Фаеруна Тей - темна і зла імперія, де жорстокі Червоні Чарівники нескінченно змахують
              батогами,
              де постійно стогнуть раби, і все що їх чекає за віддану працю - перетворення в гидких надприродних
              монстрів.
              Правда відрізняється не набагато.
            </Paragraph>
          </Box>
          <Box my={10}>
            <Paragraph fontSize="16px">
              Вільні тейці потрапляють в один з шести класів: Червоні Чарівники, бюрократи, священики, торговці, солдати
              і
              ремісники або кваліфіковані робітники - лише на крок вище простих рабів.
            </Paragraph>
          </Box>
  
          <Flex column center my={30}>
            <img src={thayParty} alt="Thay party"/>
            
            <Msg>"Кожен теєць знає - майбутнє існує лише в  стражданні ворогів"</Msg>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Тей - нація, керована жорстокими та надзвичайно могутніми чарівниками - зулкірами, які покладаються на
              рабство, щоб забезпечити себе багатством та розкішшю. Зулкіри в свою чергу вибирають тарчіонов земель -
              цивільних губернаторів, керівників мирськими справами царства і службовцями на благо Червоних Чарівників.
            </Paragraph>
          </Box>
          <Box my={10}>
            <Paragraph fontSize="16px">
              Червоні Чарівники голять все волосся на своїй голові (включаючи брови і часто вії) та іноді на всьому
              своєму
              тілі, і більшість сильно татуює себе. Такі татуювання - часто місця магічного зберігання заклять для
              надзвичайного використання (і саме вони є джерелом багатьох «дивних порятунків» ув'язнених тейців).
            </Paragraph>
          </Box>
          <Box my={10}>
            <Paragraph fontSize="16px">
              У Теї лише Червоним Чарівникам дозволяється носити червоний одяг. Їх вчать залізному самоконтролю -
              безмовному підпорядкуванню потужним старшим магам. Однак кожен Чарівник завжди таємно мріє про власну
              світову домінацію.
            </Paragraph>
          </Box>
          <Box my={10}>
            <Paragraph fontSize="16px">
              Влада Червоних Чарівників простягається далеко за межі кордонів Тея. Анклави Червоних Чарівників існують у
              безлічі великих міст всюди в країнах Внутрішнього Моря, змінюючи магічні вироби на товари, багатства і, в
              деяких випадках, рабів з дюжини країн. Тейців широко ненавидять і не довіряють їм, але широкий вибір
              магічних товарів приваблює багатьох покупців, яким байдуже на "етичні норми".
            </Paragraph>
          </Box>
          <Box my={10}>
            <Paragraph fontSize="16px">
              Червоні Чарівники Тею сумно відомі своїми «аморальними» магічними експериментами - але вони були б
              набагато
              більш небезпечні для решти Фаеруна, якби внутрішня боротьба серед їх рядів не була б настільки порочна та
              енергійна. Зулкіри постійно будують плани і змови проти своїх сусідів. А недавно серед них назрів
              серйозний
              конфлікт: не всі задоволені тим, що ліч Сзасс Тем - зулкір Некромантії Тею, де-факто взяв на себе
              керівництво країною. Один з таких - патріот та герой Рат Модар, який покинув Тей, аби заручитись
              підтримкою
              Культу Дракона та покінчити із тиранією Сзасса Тема.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Quote author="Звіт Мірлани, Тейського лицаря, вірного воїна Рат Модара"/>
          </Box>
  
          <Box my={20} px={20}>
            <Divider />
          </Box>
  
          <Box my={10}>
            <Paragraph fontSize="16px">
              Тей - віддалена держава на сході Фаеруну, відома своєю непростою історією і погонею за магічними знаннями.
              Зараз Тей знаходиться під контролем ліча Засс Тама, але далеко не всі тейці підтримують такий стан речей.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Найвідоміша фракція експатріантів Тею очолена Червоним Чарівником Рат Модаром. Ходять слухи, що вони
              вступили у домовленість з Культом Дракона у пошуку союзників для звільнення свого дому.
            </Paragraph>
          </Box>
          <Box my={10}>
            <Paragraph fontSize="16px">
              Червоних Чарівників у Флані очолює Зарлада - сильний некромант, яка вже не один раз руйнувала плани
              Фракцій.
              Відомо, що вона керується не стільки інтересами Червоних Чарівників, скільки особистими цілями.
            </Paragraph>
          </Box>
          <Box my={10}>
            <Paragraph fontSize="16px">
              Червоні Чарівники часто діють за підтримки у вигляді Тейських Лицарів. Одним з таких лицарів є Мірлана -
              вмілий воїн та лейтенант Зарлади. На відміну від чарівниці, Мірлана є фанатично відданою Рат Модару.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Quote author="з архівів Гахала Іммертума, Намісника фракції Альянс Лордів у Флані"/>
          </Box>

        </Tabs.TabPane>
        
        <Tabs.TabPane
          tab="Рат Модар"
          key="rath_modar"
        >
          <Flex center>
            <Header fontSize={24} fontWeight="bold">Рат Модар</Header>
          </Flex>
  
          <Flex column center my={30}>
            <img src={rathPortrait} alt="Rath Modar"/>
    
            <Msg>“Ми маємо керувати мертвими, а не вони нами”</Msg>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Не дивлячись на складну бюрократичну структуру, фактично Теєм керує ліч Сзасс Тем - зулкір школи
              Некромантії. Однак його хватка абсолютної влади була ослаблена внутрішньою боротьбою. Смертні Червоні
              Чарівники повстали проти своїх господарів - нежиті, знищили деяких зулкірів-лічей Сзасса Тема та прорідили
              ряди іншої нежиті. Мало хто за межами країни, знають про конфлікт в Теї. У цій тихій громадянській війні,
              обидві сторони побоюються залучати багато уваги, так як це зробить Тей легкою ціллю довгого списку
              ворогів.
              Сзасс Тем ставить під сумнів відданість всіх Червоних Чарівників, що живуть за межами Тею, і дає
              зрозуміти,
              що смерть, і навіть гірше очікує тих, хто посміє виступити проти нього.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Одним з таких вигнанців Червоних Чарівників є Рат Модар, ілюзіоніст з високими навичками, який вже давно
              перебрався на Узбережжя Мечів. Від природи цікавлячись драконами, Рат Модар швидко вийшов на контакт із
              Культом Дракона та Северином. Молодий, амбітний лідер Культу шукав могутню магію для виявлення загублених
              Масок Драконів, для того, щоб привести в дію ритуал, який б викликав Тіамат з Дев'яти Пекел. Рат Модар
              мріяв
              про армію, яка могла б протистояти та перемогти Сзасса Тема. Їх союз виник з взаємної необхідності.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Прихованою підставою для цього союзу є віра Рат Модара в те, що, коли Тіамат повернеться, вона зрозуміє,
              що
              Червоні Чарівники є ціннішими союзниками, ніж
              віддані, але недосвідчені в магії адепти Культу Дракона. Рат Модар сподівається, що Тіамат викаже свою
              прихильність тим, хто займав ключову роль в її звільненні, та дарує армію драконів для облоги Тея. Після
              повалення Сзасса Тема, Рат Модар планує зайняти місце на чолі всіх Червоних Чарівників.
            </Paragraph>
          </Box>
        </Tabs.TabPane>
        
        <Tabs.TabPane
          tab="Зарлада"
          key="zarlada"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">Зарлада</Header>
          </Flex>
  
          <Flex column center my={30}>
            <img src={zarladaPortrait} alt="Zarlada"/>
    
            <Msg>Червона Чарівниця із власними мотивами</Msg>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Про Зарладу відомо небагато. Могутня тейська чарівниця, яку Рат Модар відправив служити Культу Дракона.
              Після подій в Криптенгардені, Зарлада прибула у Флан, де очолила Червоних Чарівників. Вона провела кілька
              успішних операцій проти фракцій Флану, чим заслужила довіру Культу Дракона.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Однак виявилось, що цілі Зарлади розходяться із наказами Рат Модара. Основна причина перебування у Флані -
              це давно зниклий чарівник Денлор. Використовуючи ресурси Культу Дракона та власні магічні здібності,
              Зарладі
              вдалось обманути усіх “союзників” та завершити довгий ритуал в Проклятому Ліцеї Бейна - своїй
              штаб-квартирі
              та колишньому притулку для обдарованих дітей. Намісники фракцій Флану відправились перехопити плани
              тейської
              чарівниці, однак не повернулись.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Поточне місцезнаходження Зарлади невідоме.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <SecretText>
              Більше інформації після проходження завдання “Повернення Червоної Королеви”
            </SecretText>
          </Box>
  
        </Tabs.TabPane>
      </Tabs>
    </Box>
  )
}

export default Thay
