import React, { useEffect, useState } from 'react'
import { Alert, Tabs, Timeline } from 'antd'
import { Box, Flex } from 'noui/Position'
import { Header, SecretText, Paragraph } from 'ui/Text'
import { isMobile } from 'noui/MediaQuery'
import Portrait from 'ui/Portrait'
import tyranny1Cover from './shared/tyranny1.jpg'
import tyranny2Cover from './shared/tyranny2.jpg'
import tyranny3Cover from './shared/tyranny3.jpg'
import drums1Cover from './shared/drums1.jpg'
import swamp1Cover from './shared/swamp1.jpg'
import fire1Cover from './shared/fire1.jpg'
import thief1Cover from './shared/thief1.jpg'
import island1Cover from './shared/island1.png'
import sokil1Cover from './shared/sokil.jpg'
import sokil2Cover from './shared/sokil2.jpg'
import shadow1Cover from './shared/shadow1.jpeg'
import shadow2Cover from './shared/shadow2.jpg'
import tree1Cover from './shared/tree1.jpg'
import tree2Cover from './shared/tree2.jpg'
import route1Cover from './shared/route1.jpg'
import route2Cover from './shared/route2.jpg'
import swamp2Cover from './shared/swamp2.jpg'
import swamp3Cover from './shared/swamp3.jpg'
import pyramid1Cover from './shared/pyramid1.jpg'
import pyramid2Cover from './shared/pyramid2.jpg'
import pool1Cover from './shared/pool1.jpg'
import pool2Cover from './shared/pool2.jpg'
import escape1Cover from './shared/escape1.jpg'

const Storyline = ({history, location}) => {
  const [tab, setTab] = useState(location.hash.substring(1) || 'main')
  
  useEffect(() => {
    history.replace({
      path: location.path,
      hash: tab
    })
  }, [tab])
  
  return (
    <Box mt={10} mr={[0, 20]}>
      <Tabs
        activeKey={tab}
        onChange={setTab}
        type="card"
        tabPosition={isMobile() ? 'top' : 'left'}
      >
        {/*Головна*/}
        <Tabs.TabPane
          tab="Основна сюжетна лінія"
          key="main"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">Основна сюжетна лінія</Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              “Тиранія Драконів” - це перший сезон ігрових сесій Ліги Авантюристів. Сюжет історії крутиться навколо
              загадкового Культу Дракона та рядового портового містечка Флан.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Усі історії викладені тут - пройдені та пережиті гравцями <a
              href="https://www.facebook.com/groups/dnd.lviv/">“Прямої Гільдії”</a> в період з 2018 по 2019 рік.
              Містять певні розходження із офіційним першим сезоном Ліги Авантюристів.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Alert message="Будьте уважні: присутні спойлери!" type="error"/>
          </Box>
        </Tabs.TabPane>
        {/*Кошенята*/}
        <Tabs.TabPane
          tab="Кошенята маєтку Ковель"
          key="kitties"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">Основна сюжетна лінія</Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Альянс Лордів наймає авантюристів для небезпечного завдання: прибути у Флан та вбити одіозного чарівника
              на ім’я Денлор.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <SecretText>
              Більше інформації після проходження завдання “Кошенята маєтку Ковель”
            </SecretText>
          </Box>
        </Tabs.TabPane>
        {/*Глістер*/}
        <Tabs.TabPane
          tab="Дорога на Глістер"
          key="glister"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Дорога на Глістер
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Відновлення роботи мідних шахт в Глістері породило зацікавленість в торговців Мельваунту. Багато хто
              вкладає гроші в розробку родовищ, сподіваючись що там де є мідь - буде й золото. Група авантюристів
              погоджується супроводити караван із шахтарським приладдям, ще не усвідомлюючи істинних наслідків цього
              "легкого заробітку"....
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <SecretText>
              Більше інформації після проходження завдання “Дорога на Глістер”
            </SecretText>
          </Box>
        </Tabs.TabPane>
        {/*Проблеми*/}
        <Tabs.TabPane
          tab="Проблеми Флану"
          key="problems"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Проблеми Флану
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Флан - це портове містечко на березі Місячного Моря, де панує беззаконня та свавілля угрупування на ім’я
              Чорні Кулаки. Місцеві жителі все частіше стикаються із незгодами, які не хоче вирішувати місцева влада. Це
              “золотий час” для авантюристів, адже проблем у Флані багато, а платять за них добре.
            </Paragraph>
          </Box>
          
          <Timeline>
            <Timeline.Item>
              <Box my={10}>
                <Paragraph fontSize="16px">
                  Фракція Арфістів завжди шукає тих, хто готовий допомогти вислідити контрабандистів магічними товарами.
                  Особливо, якщо авантюристи подібні на покупця заборонених товарів. От тільки в справі замішані яйця
                  дракона, а продавець прийшов на угоду озброєний до зубів. Ситуація швидко погіршується, коли після
                  обміну
                  з’являються Вітаючі - фланські кримінальні авторитети. Усі хочуть яйце дракона, от тільки це предмет
                  виявляється фальшивкою.
                </Paragraph>
              </Box>
            </Timeline.Item>
            <Timeline.Item>
              <Box my={10}>
                <Paragraph fontSize="16px">
                  Дивні особи в червоних робах найняли гоблінів, аби ті викрадали людей в околицях Флану та шукали
                  артефакти, які мають відношення до драконів. Чорним Кулакам байдуже до цих проблем, тому авантюристи
                  єдині
                  кому є до цього справа. В ході порятунку викрадених людей, авантюристи рятують агента Жентаріму. Він
                  переконує - Жентарім не забуває тих, хто допомагає їхнім агентам.
                </Paragraph>
              </Box>
            </Timeline.Item>
            <Timeline.Item>
              <Box my={10}>
                <Paragraph fontSize="16px">
                  Валінгенське Кладовище Флану - досить велике і древнє. На ньому поховано багато видатних осіб, серед
                  яких
                  виявляється і Ксандрія Веллтран - зелений дракон, який прийняв облик жінки. Жерці Келемвора просять
                  оглянути склеп, аби переконатись, чи слухи про справжню сутність Ксандрії правдиві. Виявляється, що
                  так.
                  Як і те, що дехто намагався воскресити мертвого дракона та зробити з нього драконоліча. Альянс Лордів,
                  який насправді стояв за цим завданням, просить повідомити, якщо раптом щось подібне трапиться знову.
                </Paragraph>
              </Box>
            </Timeline.Item>
            <Timeline.Item>
              <Box my={10}>
                <Paragraph fontSize="16px">
                  Флан - це таке місце, що інколи завдання може підсісти за стіл і повідомити, що в таверні знаходиться
                  небезпечний артефакт, який становить загрозу усім присутнім. Цим предметом виявляється зуб синього
                  дракона, який стрибками блискавки захоплював контроль над відвідувачами таверни. Лише своєчасна
                  реакція
                  дозволила нейтралізувати артефакт та заслужити довіру Смарагдового Анклаву.
                </Paragraph>
              </Box>
            </Timeline.Item>
            <Timeline.Item>
              <Box my={10}>
                <Paragraph fontSize="16px">
                  Флан контролюється Чорними Кулаками - військовим угрупуванням, що мало б слідкувати за порядком, а
                  натомість насаджує тиранію. Користуючись власною силою, солдати арештовують всіх підряд та саджають їх
                  в
                  таємну тюрму під Проклятим Ліцеєм Бейна. Там вони стравлюють в’язнів і монстрів, насолоджуючись
                  кривавим
                  шоу. Лише відчуття справедливості та гості мечі дозволяють авантюристам звільнити полонених, серед
                  яких і
                  друзі Ордену Латної Рукавиці.
                </Paragraph>
              </Box>
            </Timeline.Item>
          </Timeline>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Містечко Флан досить невелике, але в нього багато проблем. І скільки б авантюристи не старались, цих
              проблем ставатиме все більше. Адже Флан володіє маленьким секретом. Таємницею, через яку весь регіон
              Місячного Моря опиниться в смертельній небезпеці.
            </Paragraph>
          </Box>
        </Tabs.TabPane>
        {/*Сокіл*/}
        <Tabs.TabPane
          tab="Таємниці фортеці Сокіл"
          key="sokil"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Таємниці фортеці Сокіл
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              В історії Флану було дві багаті родини, які конкурували за місто - родина Ковель
              та родина Сокіл. Однак час урівняв їх обох. Про родину Ковель всі забули, а від родини Сокіл залишилась
              гордість останніх спадкоємців. Та десятки маєтків по цілому Фаеруну, що перебували в різній степені
              розрухи. Однією з найбільш цілих була фортеця Сокіл.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Знаходячись на острові Торн, фортеця уже давно не виконувала свою першочергову функцію. Єдине що
              залишилось цілим поміч розвалених бійниць - це маяк, який освітлював шлях до гавані. А також легенди, про
              скарби родини Сокіл, заховані десь в забутих катакомбах.
            </Paragraph>
          </Box>
          
          <Portrait
            src={sokil1Cover}
            alt="sokil 1"
            my={30}
          />
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Ніхто ніколи не бачив ці міфічні скарби, однак легенди завжди розбурхували уяву Ігана Сокола. Будучи
              бідним аристократом, без шансу отримати впливове місце серед достойних людей, він часто мріяв про те, як
              заховані родини Сокіл подарують йому достойне життя. І коли доля підкинула шанс стати наглядачем маяка на
              острові Торн, Іган Сокіл вирішив потратити весь свій час для пошуків примарних скарбів.
            </Paragraph>
          </Box>
          
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Чорні Кулаки розмістити на острові гарнізон, аби слідкувати за роботою маяка. Сержант Грім Торнбак
              подружився
              із Іганом Соколом, та допоміг йому розкопати вхід в катакомби під фортецею Сокіл. Вони дійсно знайшли
              скарби,
              однак це виявилось жертвоприношенням для невідомої істоти на ім’я Глибинний Бог. Іган вирішив, що ці
              багатства
              прокляті і спробував їх знищити. Сержант Грім, який керувало бажання особистого збагачення, вбив свого
              “товариша”. Однак це лише погіршило становище - кров розбудила стражу підземного храму. Сержант Грім та
              Чорна
              Варта опинились в пастці.
            </Paragraph>
          </Box>
          
          <Portrait
            src={sokil2Cover}
            alt="sokil 2"
            my={30}
          />
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Харае була послушницею храму Тіра, і коли вона померла, її душа залишилась прив’язана до прихованої
              каплички на острові Торн. Іган Сокіл знайшов капличку та відремонтував її. Через це Харае вирішила
              віддячити чоловіку, та показала прохід на підземні катакомби. Коли сержант Грім вбив Ігана, Харае погасила
              маяк.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Група авантюристів прибула на острів, аби розслідувати причину погаслого маяка. Знайшовши сержанта Гріма
              та дізнавшись правду, вони віддали його під суд. Це задовільнило Харае, і вона знову запалила маяк.
            </Paragraph>
          </Box>
        
        </Tabs.TabPane>
        {/*Тіні*/}
        <Tabs.TabPane
          tab="Тіні над Місячним морем"
          key="shadows"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Тіні над Місячним морем
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Йовір Глендон викликає до себе авантюристів - послушники Келемвора знайшли божевільного, який кричав про
              драконоліча та його багаторуких посіпак, що спалили селище. Розслідування показали - прибережне селище
              дійсно було спалено дотла. Більше того, таких селищ було кілька, кожне з яких усе ближче і ближче до
              Флану. Побачивши закономірність в атаках, авантюристи відправляються на малий острів, де знаходиться
              безіменне рибацьке селище.
            </Paragraph>
          </Box>
          
          <Portrait
            src={shadow1Cover}
            alt="sokil 1"
            my={30}
          />
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Люди, що живуть на цьому острові виглядають нездорово та відлюдкувати. Усі, окрім дівчинки Елісандри та її
              сліпої кози, ставляться до прибулих із недовірою. І згодом знаходиться причина цієї ворожості.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              60 років тому піратський корабель “Зухвалий” прибув до берега цього острівця. Пірати швидко захопили
              острів, та взяли мешканців в рабство. Однак рибаки виявились дияволопоклонниками і обміняли свої душі на
              те, щоб загарбників забрали в пекло.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Авантюристи зуміли переконати мешканців острова організувати оборону та приготуватись до приходу
              драконоліча. Із приходом темряви та туману, з моря почали виходити містичні створіння... Які на перевірку
              виявились звичайними кобольтами, одягнутими в лахміття та з приклеєними зайвими кінцівками.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Виявляється, Культ Дракона відправився на пошуки “Зухвалого”. Згідно давньої інформації, пірати
              пограбували галеон, що перевозив цінну магічну літературу. Серед книг була також інформація про
              легендарний артефакт - Маска Зеленого Дракона. Аби приховати свої пошуки, Культ замаскував свій корабель
              під драконоліча та розпустив слухи про древнє прокляття. Хто ж в здоровому глузді буде полювати на
              гігантську мертву потвору?
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Але авантюристи розкусили обман, та зрештою опинились на самому “драконолічі”, щоб покінчити з
              культистами. От тільки в цей момент з пекла повернувся “Зухвалий” та його диявольська команда. Опинившись
              між двома вогнями, авантюристам прийшлось проявити неймовірну витримку, аби покінчити з двома загрозами за
              один раз.
            </Paragraph>
            
            <Portrait
              src={shadow2Cover}
              alt="sokil 1"
              my={30}
            />
          
          </Box>
        
        </Tabs.TabPane>
        {/*Криптенгарден*/}
        <Tabs.TabPane
          tab="Гниль Криптенгардена"
          key="cryptogarden"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Гниль Криптенгардена
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Фракції Фаеруну дізнались про розміщення древнього артефакту. А значить прийшов час об’єднати зусилля,
              зібрати війська і рушити в глибину містичного лісу Криптенгарден та кинути виклик його господарю -
              древньому дракону Клагелеуматар.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <SecretText>
              Більше інформації після проходження завдання “Битва за Флан”
            </SecretText>
          </Box>
        </Tabs.TabPane>
        {/*Данина*/}
        <Tabs.TabPane
          tab="Данина мертвим"
          key="tribute"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Данина мертвим
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Орден Келемвора давно опікується мертвими, відправляючи їх в останню путь та упокоюючи на Валінгенському
              кладовищі. Але недавно серед кілька послушників було знайдено вбитими, частково з’їдженими. А тому
              настоятель ордену, Провідник Мертвих Йовір Глендон, звертається за допомогою.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Досліджуючи катакомби Валінгенського кладовища разом із послушницею Кассіт, авантюристи знаходять причину
              надзвичайної активності мертвих - Червоного Чарівника на ім’я Роррет. Правда, некромант швидко
              телепортується геть, залишивши замість себе зомбі, кобольтів та Тейського лицаря на ім’я Мірлана.
            </Paragraph>
          </Box>
          
          <Portrait
            src={swamp1Cover}
            alt="гул 1"
            my={30}
          />
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Перемігши посіпак Роррета, авантюристи дізнаються про причину його перебування тут. Культ Дракона планував
              використати некромантію, аби підняти армію мертвих і захопити Флан. Також були знайдена карта міста із
              обведеним замком Вальєво та підписом “Сяюче Озеро”
            </Paragraph>
          </Box>
        </Tabs.TabPane>
        {/*Вшанування вогню*/}
        <Tabs.TabPane
          tab="Вшанування вогню"
          key="fire"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Вшанування вогню
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Бібліотека Мантора - це найстаріша бібліотека не лише Флану, а й усього регіону. В ній зберігається багато
              давньої літератури, зі своїми загадками, пророцтвами та захованими посланнями. Окрема каста писарів
              утворилась з необхідності переписувати древні письмена та шукати забуті знання. Тому коли трапилась
              крадіжка - це одразу привернуло увагу Лорда Мудреця, куратора бібліотеки.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              В ході розслідування було виявлено, що три послідовники Культу Дракона прибули у Флан кілька місяців тому,
              аби розшукати невідомі древні документи. Двоє з культистів поселились в бібліотеці Мантора, де втерлись в
              довіру до Лорд Мудреця та пограбували його кабінет. Культист на ім’я Тібім був вбитий при втечі, в той час
              як Спернік зміг втекти із фоліантом, який розповідав історію Храму Чешуї.
            </Paragraph>
          </Box>
          
          <Portrait
            src={fire1Cover}
            alt="fire 1"
            my={30}
          />
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Століття тому секта друїдів-драконопоклонників оселилась у підніжжя Драконячого Хребта. Вони побудували
              великий підземний компекс в горі та вирішили поработити драконів за допомогою містичного артефакту. Однак
              щось пішло не так - і червоний дракон з армією орків знищив секту, а лідер друїдів запечатав себе в
              підземному храмі.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Саме його і шукав Спернік, намагаючись отримати забутий артефакт, аби принести його в дар червоному
              дракону та заручитись його підтримкою. Однак авантюристи завадили його планам, перш ніж культисту вдалось
              розпечатати релікварій.
            </Paragraph>
          </Box>
        </Tabs.TabPane>
        {/*Крадій свитків*/}
        <Tabs.TabPane
          tab="Крадій свитків"
          key="scrolls_thief"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Крадій свитків
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Еллісон Беренжер кілька місяців тому прибув у Флан разом зі своїми товаришами - Тібімом та Сперніком.
              Культ Дракона відрядив їх, аби знайти забуті книги про артефакти драконів. Поки його товариші втирались в
              довіру до Лорда Мудреця, Еллісон вдався до серії крадіжок на площі Школяра. Культист вкрав книги та записи
              авантюристів, що колись взаємодіяли із містичним Сяючим Озером, яке колись існувало у Флані. Культ Дракона
              хотів використати це знання, аби знайти Озеро та використати його силу. Однак самого Еллісона цікавило
              інше - книга “Лорди і Династії Флану”.
            </Paragraph>
          </Box>
          
          <Portrait
            src={thief1Cover}
            alt="thief 1"
            my={30}
          />
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Сотню років тому Жентарім спалив усю офіційну історію старого Флану, особливо все, що показувало в
              поганому світлі його або Бейна - бога, в якого вірили послідовники Чорної Мережі. У вогні згорів і родовід
              дому Беренжер, через що Еллісон ніколи не мав дворянського статусу та був змушений ледь не жебрати на
              вулиці..
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Однак, отримавши бажане, культист дізнався, що насправді ніколи не мав ніякого аристократичного минулого,
              і все життя його обманювали, аби використати в своїх цілях. Демотивований та стомлений, Еллісон не
              опирався, коли його знайшли авантюристи, найняті Чорними Кулаками. Все його життя виявилось брехнею.
            </Paragraph>
          </Box>
        </Tabs.TabPane>
        {/*Гул барабанів*/}
        <Tabs.TabPane
          tab="Гул барабанів"
          key="drums"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Гул барабанів
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Останні кілька днів вітер приносить з Сутінкового Болота гул барабанів. Кожного ранку із ферм неподалік
              хтось пропадає, і лише розмиті сліди ведуть кудись до води. Жителі околиць стурбовані, а тому звертаються
              за допомогою до авантюристів.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Дослідження розграбованих ферм та пошуки слідів приводять до ящеролюдів, які стоять за цими викраденнями.
              Під шум барабанів вони крадуться околицями та беруть в полон сильних людей і тварин, а потім транспортують
              їх в своє лігво. І роблять це не просто так, а як дар своєму новому вождю.
            </Paragraph>
          </Box>
          
          <Portrait
            src={drums1Cover}
            alt="гул 1"
            my={30}
          />
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Місяць тому чорний дракон на ім’я Тростульграель покинув своє лігво біля Мулмастера, аби захопити
              Сутінкове Болото. Він підкорив собі три племені ящеролюдів та вбив їхнього короля. Тростульграель зажадав,
              аби племена змагались за його прихильність та приносили йому в данину гуманоїдів та звірів. Тому, хто
              принесе найкращу здобич, дракон дарує можливість бути його замісником.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Однак Топекоготь, син короля ящерів, вирішив перехопити владу. Користуючись відсутністю дракона, він
              влаштував велику бійку, аби перебити вождів усіх племен. Під прикриттям загального хаосу, авантюристам
              вдалось звільнити викрадених та втекти.
            </Paragraph>
          </Box>
        </Tabs.TabPane>
        {/*Історії*/}
        <Tabs.TabPane
          tab="Історії, розказані деревами"
          key="tales"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Історії, розказані деревами
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Коли Жентарім взяв під свій контроль Флан, вони заключили пакт між містом і темними феями із Лісу, що
              Тріпоче на півночі. В обмін на заборону вирубки лісу, феї пообіцяли захищати Флан. Це слово було дотримане
              під час війни десятиліття потому, яка зруйнувало багато міст в регіоні.
            </Paragraph>
          </Box>
          
          <Portrait
            src={tree1Cover}
            alt="tree 1"
            my={30}
          />
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Пагорб Кейбла - невелике селище на кордоні Лісу, що Тріпоче та річки Стоянов. Місяць тому там почали
              відбуватись дивні речі. Усі вони вели до зниклого місцевого столяра Хелвіна Грейнгла, який чомусь вирішив
              відправитись в саме серце Лісу, що Тріпоче. Боячись помсти фей, група селян відправилась за столяром.
              Однак минуло три тижні - не повернулись ні Хелвін, ні “рятувальна експедиція”. Тоді мешканці Пагорба
              Кейбла попросили про допомогу Флан.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Група авантюристів відправилась по сліду Хелвіна, і вияснила, що він був не просто столярем. А
              прихильником Культу Дракона, мета якого - розірвати древній пакт, що захищав Флан. Йому вдалось зустрітись
              із каргою Дженні Зеленозубою, але та просто вбила культиста. Прихід селян лише розізлив хазяйку лісу, і
              вона вирішила провчити незваних гостей. Авантюристи не знайшли підходу до озлобленої феї, вирішивши вбити
              її. В результаті пакт було нарушено, і Флан залишився без захисту.
            </Paragraph>
          </Box>
          
          <Portrait
            src={tree2Cover}
            alt="tree 2"
            my={30}
          />
        </Tabs.TabPane>
        {/*Бандити*/}
        <Tabs.TabPane
          tab="Бандити Залізного шляху"
          key="iron_route"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Бандити Залізного шляху
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Лицар Санд Крулек був одним із нижчих чинів Чорних Кулаків. Однак він перейшов дорогу одному впливовому
              аристократу, і Санда підставили та приговорили до смерті. Знаючи що Крулек невинний, інша група Чорних
              Кулаків допомогла йому втекти. Аби помститись аристократам, ця група назвала себе “Сірими Патріотами” та
              почали грабувати багатих купців, що працювали на дворянство Флану і ніколи не вбивали без необхідності.
              Однак з часом Санд Крулек увійшов в азарт, і його “Сірі Патріоти” ставали все більш і більш жорстокими, і
              все більш нагадували тих бандитів, яких колись ловили.
            </Paragraph>
          </Box>
          
          <Portrait
            src={route1Cover}
            alt="route 1"
            my={30}
          />
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Нещодавно в регіоні з’явилась драконорождена чародійка на ім’я Джералла із армією мутованих кобольтів.
              Називаючись “Кігтями Тіамат”, вони грабували усіх без розбору, вносячи хаос в торгове життя Флану. Кілька
              місяців її армія воювала із організованою бандою Санда Крулека, поки не був закладений фундамент для
              перемир’я. Дві сторони зустрілись біля Королівського Багаття, напівзнищеної статуї на березі Місячного
              Моря.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Культ Дракона спробував налагодити відносини із Джераллою та зрозуміти її істинні наміри, заславши шпигуна
              в ряди чародійки. Але зрозумівши, що вони не можуть керувати амбітною Джераллою, Культ найняв ороче плем’я
              на ім’я Палаючий Прапор та знищив і банду “Сірих Патріотів”, і “Кігті Тіамат”.
            </Paragraph>
          </Box>
          
          <Portrait
            src={route2Cover}
            alt="route 1"
            my={30}
          />
        
        </Tabs.TabPane>
        {/*Тиранія*/}
        <Tabs.TabPane
          tab="Тиранія Флану"
          key="tyranny"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Тиранія Флану
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Все змінюється у Флані, і при тому - в гіршу сторону. В регіоні навколо частішають сутички із орками та
              кобольтами, в кожній кримінальній справі виявляється замішана якась третя сторона. Лицар-Командор Ектор
              Брамс, Лорд Регент Флан, вирішив нарешті розібратись із цією проблемою. Він не політик, а воїн, і досить
              довго заплющував очі на свавілля своїх підлеглих, Чорних Кулаків, а також на проблеми міста. Тому Ектор
              Брамс збирає секретну зустріч усіх голів гільдій та впливових дворян, аби спільними зусиллями придумати
              спільний план розвитку Флану. На зустрічі має бути Айя Гленмір - ексцентрична ельфійська чарівниця, але
              вона запізнюється.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Тим часом Алейд Буррал знову потребує допомоги авантюристів. Культист Спернік - один із ключових доказів,
              що за дивними подіями у Флані стоїть Культ Дракона. Його тримають в тюрмі на Воротах Стоянов. От тільки
              суд на ним все ніяк не може відбутись. Більше того, в його камеру постійно ходять якісь особи, та й
              культист все менше і менше нагадує в’язня. Алейд потребує доказів корумпованості Чорних Кулаків, для того,
              щоб презентувати їх на сьогоднішній таємній нараді Лорда Регента. Варто тільки авантюристам погодитись на
              цю справу, як ситуація кардинально змінюється - величезний зелений дракон на ім’я Ворганшаракс влітає у
              Флан. Своїм руйнівним диханням він перетворює Валінгенський цвинтар на кислотне болото, знищивши храм
              Келемвора та усіх послушників. Далі дракон нападає на замок Вальєво, розламуючи стіни та вбиваючи усіх,
              хто зібрався на секретну нараду Ектора Брамса.
            </Paragraph>
          </Box>
          
          <Portrait
            src={tyranny1Cover}
            alt="тиранія 1"
            my={30}
          />
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Вискочивши на вулицю авантюристи стають свідками хаосу - армія Культу Дракона захоплює Флан, виходячи з
              каналізаційних тунелів та з прихованих кораблів. Виявляється, підготовка до цієї атаки велась не один
              тиждень: культисти та їхні послідовники невеликими групами прибували у Флан на кораблях та ховались в
              покинутих складах, чекаючи сигналу.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              У вуличних сутичках загинув Маркот, він же Товстий Мар, офіціант з таверни “Гоблін, що Сміється”. Зате
              вдалось звільнити полонену Айю Гленмір, яка розповіла - через її запізнення лорд Ектор Брамс не потрапив
              на власну секретну зустріч, а тому він досі може бути живим. Це надихнуло Алейд Буррал на план по
              звільненню свого командира. За підтримки злочинців Вітаючих, які швидко перекваліфікувались в народних
              героїв, та дівчинки Елісандри з її сліпою козою, що невідомо як опинилась у Флані, була проведена атака на
              Ворота Стоянов - місце, де культисти тримали полонених як данину для дракона. Алейд Буррал пожертвувала
              своїм життя, відволікаючи Сльози Злоби - колишніх Чорних Кулаків, що перейшли на сторону нападників. Це
              дало можливість авантюристам врятувати Лорда Регента.
            </Paragraph>
          </Box>
          
          <Portrait
            src={tyranny2Cover}
            alt="тиранія"
            my={30}
          />
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Опісля агенти Арфістів проникли у в’язничний комплекс та вбили Сперніка - виявилось, що саме він
              координував атаку дракона на замок. За допомогою Альянсу Лордів та Кассіт, єдиної вижившої послушниці
              Келемвора, авантюристи виводять врятованих людей з Флану, лише щоб бути атакованою Іксусаксою - лідером
              Культу Дракона у Флані.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Втікачам вдалось відбити цю атаку, однак в бою гине Ектор Брамс, Лорд Регент Флану. Його тіло, разом із
              тілом Алейд Буррал, транспортують до Мулмастера, в надії на воскресіння.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Хоча вдалось звільнити значну частину мешканців Флану, саме місто опинилось під тиранією Ворганшаракса та
              Культу Дракона. Тим, кому не було куди тікати, прийшлось змиритись життям в постійному страху та
              жорстокості. Або організувати рух повстання.
            </Paragraph>
          </Box>
          
          <Portrait
            src={tyranny3Cover}
            alt="тиранія"
            my={30}
          />
        
        </Tabs.TabPane>
        {/*Вежа*/}
        <Tabs.TabPane
          tab="Вежа Денлора"
          key="denlor_tower"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Вежа Денлора
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Більше сотні років тому у Флані жив могутній чарівник на ім’я Денлор. Він зник за дивних обставин,
              залишивши по собі лише вежу, запечатану невідомою магією. І ось нарешті прийшов час дізнатись, що
              знаходиться за її дверима.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <SecretText>
              Більше інформації після проходження завдання “Острів Десяти”
            </SecretText>
          </Box>
        </Tabs.TabPane>
        {/*Острів10*/}
        <Tabs.TabPane
          tab="Острів Десяти"
          key="island_10"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Острів Десяти
            </Header>
          </Flex>
          
          <Portrait
            src={island1Cover}
            alt="island1Cover 1"
            my={30}
          />
        </Tabs.TabPane>
        {/*Мародери*/}
        <Tabs.TabPane
          tab="Мародери Сутінкового болота"
          key="swamp"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Мародери Сутінкового болота
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Після того як авантюристи завадили Тростульграелю захопити контроль над племенами людоящерів, чорний
              дракон почав мститись, в безсильній злобі знищуючи кораблі, ферми та каравани. Культ Дракона вирішив
              укласти угоду із Тростульграелем та запросив його у Флан, на переговори.
            </Paragraph>
          </Box>
          
          <Portrait
            src={swamp2Cover}
            alt="swamp 2"
            my={30}
          />
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Тим часом Топекоготь, син короля ящерів, об’єднав залишки людоящерів. Розуміючи, що в нього немає шансів
              проти Тростульграеля, він пустив слух, що дракон полетів і його лігво зі скарбами стало легко доступним.
              Авантюристи не змогли встояти перед такою спокусою.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Користуючись вказівками Топекогтя, їм вдалось проникнути скарбницю Тростульграеля. Однак дракон повернувся
              саме вчасно, аби застати злодюжок за крадіжкою, та у важкій сутичці дозволив себе вбити.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Виявляється Тростульграель уклав угоду з Культом Дракона, та дозволив перетворити себе на драконоліча. Усі
              ритуали були завершено, залишалось тільки померти. Авантюристи чудово з цим справились. Тростульграель
              воскрес в своїй новій формі та зник в невідомому напрямку.
            </Paragraph>
          </Box>
          
          <Portrait
            src={swamp3Cover}
            alt="swamp 3"
            my={30}
          />
        </Tabs.TabPane>
        {/*Піраміда*/}
        <Tabs.TabPane
          tab="Темна піраміда Острову Чаклуна"
          key="dark_pyramid"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Темна піраміда Острову Чаклуна
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Яраша не даремно називали божевільним чарівником. Будучи непримиренним суперником Денлора, він створив
              магічну піраміду в околицях Флану, в якій проводив свої досліди із живими істотами та Плетінням. Після
              того як авантюристи вбили Яраша, його логово почало жити своїм життям. Виживші експерименти та різні
              мутанти заполонили рівні піраміди, влаштувавши маленькі королівства зі своїми правилами.
            </Paragraph>
          </Box>
          
          <Portrait
            src={pyramid1Cover}
            alt="pyramid 1"
            my={30}
          />
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Півсотні роки потому забута піраміда несподівано починає виділяти магічну енергію. Культ Дракона
              відправляє експедицію, аби дізнатись, що відбувається. Тейські шпигуни, на чолі із Червоним Чарівником
              Рорретом, намагаються захопити цю хаотичну силу для себе. Фракції Флану наймають авантюристів, аби
              випередити інших, та знищити магічний спадок Яраша.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Виявилось, що древні механізми піраміди активували слаади. Будучи звичайними шукачами пригод, вони
              інфікувались під час однієї зі своїх пригод. Шукаючи спасіння, вони проникли у піраміду Яраша, де і
              відбулось фінальне перетворення. Слаади знайшли щоденники божевільного чарівника та змогли відкрити портал
              в Лімбо, аби перетворити навколишній світ у свій.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Коли авантюристи добрались на верх піраміди, вони перемогли слаадів і уклали з ними пакт - у випадку
              небезпеки слаади прийдуть на допомогу Флану. От тільки що їм дадуть взамін - авантюристи не розповіли.
            </Paragraph>
          </Box>
          
          <Portrait
            src={pyramid2Cover}
            alt="pyramid 2"
            my={30}
          />
        
        </Tabs.TabPane>
        {/*Повстанці*/}
        <Tabs.TabPane
          tab="Повстанці Флану"
          key="phlan_rebels"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Повстанці Флану
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Культ Дракона прийшов до влади у Флані. І хоча керівництво усіх фракцій було знищено, віддані агенти не
              померли. Вони зачаїлись, аби власними силами відбудувати те, що знищено, та в партизанській боротьбі, крок
              за кроком, зробити найголовніше - повернути своє місто!
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Це ваша історія, яка твориться саме зараз!
            </Paragraph>
          </Box>
        </Tabs.TabPane>
        {/*Рада*/}
        <Tabs.TabPane
          tab="Рада Вотердіпу"
          key="council"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Рада Вотердіпу
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Дивні культисти вбивають невинних та забирають усе золото. А допомагають їм у цьому дракони. Фракції
              Фаеруну відкинули чвари заради спільної мети - зрозуміти що задумав Культ Дракона і зупинити їх.
            </Paragraph>
          </Box>
        </Tabs.TabPane>
        {/*Відродженя*/}
        <Tabs.TabPane
          tab="Відродження Сяючого Озера"
          key="pool"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Відродження Сяючого Озера
            </Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Культ Дракона витратив багато часу та ресурсів аби не просто знищити Флан, а захопити його та встановити
              свою владу. Все це було зроблено заради доступу до містичного Сяючого Озера, заховано глибоко під замком
              Вальєво. Згідно легенд воно дарує вічне життя, вміє воскрешати, та і взагалі є джерелом безграничної
              магії. Витративши місяці на розкопки, культисти нарешті достались бажаного… лише щоб дізнатись, що Сяюче
              Озеро Флану втратило свою магічну силу. Адже кілька місяців тому в кратер Крануна впала загадкова зірка,
              як утворила в регіоні нове Сяюче Озеро, що перебрало на себе силу Озера під замком Вальєво. Культ Дракона
              організовує експедицію, аби дослідити цей магічний феномен. Повстання кидає усі сили, аби випередити їх.
            </Paragraph>
          </Box>
          
          <Portrait
            src={pool1Cover}
            alt="pool 1"
            my={30}
          />
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Крануна - кам’яний гігант-шаман, вигнаний із власного племені. Живучи усамітненим життям, він вважав, що
              небо реальне, а істоти, що живуть на поверхні, неповноцінні по своїй суті. Однак після того, як падаюча
              зірка утворила нове Сяюче Озеро і Кранун торкнувся його, характер гіганта кардинально помінявся. Він став
              агресивним, хитрим та утворив союз із племенем орків Палаючий Прапор.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Причина цієї дивної зміни поведінки - позапланарна сутність на ім’я Тирантраксус, що живе в Сяючому Озері.
              Захопивши тіло шамана, істота почала накопичувати сили із невідомих мотивів.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Хоча авантюристам вдалось зупинити експедицію Культу Дракона та вбити Крануна, фрагмент води із Сяючого
              Озера таки потрапив в руки культистів. Дракон Ворганшаракс вирішив особисто дослідити це “джерело магічної
              сили”. Так Тирантраксус знайшов собі нове тіло.
            </Paragraph>
          </Box>
          
          <Portrait
            src={pool2Cover}
            alt="pool 2"
            my={30}
          />
        </Tabs.TabPane>
        {/*Escape*/}
        <Tabs.TabPane
          tab="Втеча з Флану"
          key="escape"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Втеча з Флану
            </Header>
          </Flex>
          
          <Portrait
            src={escape1Cover}
            alt="escape 1"
            my={30}
          />
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Після того як Культ Дракона захопив Флан, він оточив місто магічним чагарником, аби захистити місто від
              зовнішнього нападу. Отруйні кущі заважають пересуватись,а містичний туман поглинає усіх, хто має
              необережність зустрітись з ним. Наближаються війська союзників, а Культ Дракона от-от закінчить ритуал,
              пов’язаний із Сяючим Озером. Розуміючи, що Флан скоро стане зоною бойових дій, повстанці планують вивезти
              за межі міста трьох ключових осіб.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Група авантюристів відправляються рятувати мадам Фреону (власницю постоялого двору “Заварник”), Лорда
              Мудреця (наймудрішої людини Флану) та Джессаілу Грейткастл - колишнього Чорного Кулака та суперницю Алейд
              Буррал. По дорозі їм трапляється Еллісон Беренжер - культист, що втік з-під варти Чорних Кулаків, коли
              Ворганшаракс захопив Флан. Однак йому не вдалось покинути місто перш ніж чагарник закрив усі проходи.
              Об’єднавши свої сили із авантюристами, культист допоміг повстанцям звільнити усіх ключових осіб. Однак чи
              залишиться він їхнім союзником надалі? Час покаже...
            </Paragraph>
          </Box>
        </Tabs.TabPane>
        {/*Фінал*/}
        <Tabs.TabPane
          tab="**фінал сезону**"
          key="end_game"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">
              Фінал сезону
            </Header>
          </Flex>
          
          <Box my={10}>
            <SecretText>
              Більше інформації після проходження усіх завдань основної сюжетної лінії
            </SecretText>
          </Box>
        </Tabs.TabPane>
      </Tabs>
    </Box>
  )
}

export default Storyline
