import React, { useEffect, useState } from 'react'
import { Tabs } from 'antd'
import { Box, Flex } from 'noui/Position'
import { Header, Quote, Paragraph, SecretText } from 'ui/Text'
import { isMobile } from 'noui/MediaQuery'
import Portrait from 'ui/Portrait'
import rathPortrait from './shared/rath.jpg'
import zarladaPortrait from './shared/zarlada.jpg'
import chesterPortrait from './shared/chester.jpg'
import severynPortrait from './shared/severyn.jpg'
import johnPortrait from './shared/john.jpg'
import cronPortrait from './shared/cron.jpg'
import dragonPortrait from './shared/dragon.jpg'
import tiamatPortrait from './shared/tiamat.png'

const Enemies = ({history, location}) => {
  const [tab, setTab] = useState(location.hash.substring(1) || 'rath_modar')
  
  useEffect(() => {
    history.replace({
      path: location.path,
      hash: tab
    })
  }, [tab])
  
  return (
    <Box mt={10} mr={[0, 20]}>
      <Tabs
        activeKey={tab}
        onChange={setTab}
        type="card"
        tabPosition={isMobile() ? 'top' : 'left'}
      >
        {/*Тіамат*/}
        <Tabs.TabPane
          tab="Тіамат"
          key="tiamat"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">Тіамат</Header>
          </Flex>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              П’ятиголова королева, божество злих драконів, вбивця богів - як тільки не називають Тіамат. Вона -
              уособлення усіх негативних рис своїх дітей, хроматичних драконів. Жадіблива, мстива, надзвичайно сильна і
              безсмертна.
            </Paragraph>
          </Box>
  
  
          <Portrait
            src={tiamatPortrait}
            alt="Dragon"
            label="Мене звати Ворганшакс, Понівечена Злоба. Вам краще запам'ятати це ім'я"
            my={30}
          />
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Тіамат було вигнано з Фаеруну і запечатано в плані дияволів - Дев’яти пеклах. Там вона знаходиться в
              полоні, чекаючи моменту повернутись та помститись як богам, так і смертним. Багато хто не лише чекає її
              втечі зі своєї “в’язниці”, а й активно працює над визволенням злого божества.
            </Paragraph>
          </Box>
        </Tabs.TabPane>
        {/*Ворганшаракс*/}
        <Tabs.TabPane
          tab="Ворганшакс, Понівечена Злоба"
          key="green_dragon"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">Ворганшакс</Header>
          </Flex>
          
          <Portrait
            src={dragonPortrait}
            alt="Dragon"
            label="Мене звати Ворганшакс, Понівечена Злоба. Вам краще запам'ятати це ім'я"
            my={30}
          />
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Ворганшакс - це дорослий зелений дракон, майже що древній, чий величезний розмір перевершує лише ще більш
              величезне его. Незважаючи на жорстоку травму, у вигляді покаліченого і порваного крила, залишену йому
              бронзовим драконом ще в ті часи, коли він був вірмлінгом, Ворганшакс все одно справляє дуже сильне
              враження. Він достатньо великий та сильний, навіть в порівнянні з іншими драконами. В результаті травми та
              розміру, він досить незграбний літун, проте жахливо руйнівний
              на землі.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Ворганшакс є породженням древнього зеленого дракона Клагелеуматар, що править в лісі Криптенгарден далеко
              на заході. У якості помсти фракціям Фаеруну за події в її лісі, вона позичила (хоча скоріше продала)
              допомогу Ворганшакса Культу Дракона.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              У Ворганшакса є величезна кількість кобольдов, дракононароджених та напівдраконів, які фанатично віддані
              йому, багато з них володіють знаннями потужної магії.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <SecretText>
              Більше інформації після проходження завдання “Відродження Сяючого Озера”
            </SecretText>
          </Box>
        </Tabs.TabPane>
        {/*Rath Modar*/}
        <Tabs.TabPane
          tab="Рат Модар"
          key="rath_modar"
        >
          <Flex center>
            <Header fontSize={24} fontWeight="bold">Рат Модар</Header>
          </Flex>
          
          <Portrait
            src={rathPortrait}
            alt="Rath Modar"
            label="Ми маємо керувати мертвими, а не вони нами"
            my={30}
          />
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Не дивлячись на складну бюрократичну структуру, фактично Теєм керує ліч Сзасс Тем - зулкір школи
              Некромантії. Однак його хватка абсолютної влади була ослаблена внутрішньою боротьбою. Смертні Червоні
              Чарівники повстали проти своїх господарів - нежиті, знищили деяких зулкірів-лічей Сзасса Тема та прорідили
              ряди іншої нежиті. Мало хто за межами країни, знають про конфлікт в Теї. У цій тихій громадянській війні,
              обидві сторони побоюються залучати багато уваги, так як це зробить Тей легкою ціллю довгого списку
              ворогів.
              Сзасс Тем ставить під сумнів відданість всіх Червоних Чарівників, що живуть за межами Тею, і дає
              зрозуміти,
              що смерть, і навіть гірше очікує тих, хто посміє виступити проти нього.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Одним з таких вигнанців Червоних Чарівників є Рат Модар, ілюзіоніст з високими навичками, який вже давно
              перебрався на Узбережжя Мечів. Від природи цікавлячись драконами, Рат Модар швидко вийшов на контакт із
              Культом Дракона та Северином. Молодий, амбітний лідер Культу шукав могутню магію для виявлення загублених
              Масок Драконів, для того, щоб привести в дію ритуал, який б викликав Тіамат з Дев'яти Пекел. Рат Модар
              мріяв
              про армію, яка могла б протистояти та перемогти Сзасса Тема. Їх союз виник з взаємної необхідності.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Прихованою підставою для цього союзу є віра Рат Модара в те, що, коли Тіамат повернеться, вона зрозуміє,
              що
              Червоні Чарівники є ціннішими союзниками, ніж
              віддані, але недосвідчені в магії адепти Культу Дракона. Рат Модар сподівається, що Тіамат викаже свою
              прихильність тим, хто займав ключову роль в її звільненні, та дарує армію драконів для облоги Тея. Після
              повалення Сзасса Тема, Рат Модар планує зайняти місце на чолі всіх Червоних Чарівників.
            </Paragraph>
          </Box>
        </Tabs.TabPane>
        {/*Zarlada*/}
        <Tabs.TabPane
          tab="Зарлада"
          key="zarlada"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">Зарлада</Header>
          </Flex>
          
          <Portrait
            src={zarladaPortrait}
            alt="Zarlada"
            label="Червона Чарівниця із власними мотивами"
            my={30}
          />
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Про Зарладу відомо небагато. Могутня тейська чарівниця, яку Рат Модар відправив служити Культу Дракона.
              Після подій в Криптенгардені, Зарлада прибула у Флан, де очолила Червоних Чарівників. Вона провела кілька
              успішних операцій проти фракцій Флану, чим заслужила довіру Культу Дракона.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Однак виявилось, що цілі Зарлади розходяться із наказами Рат Модара. Основна причина перебування у Флані -
              це давно зниклий чарівник Денлор. Використовуючи ресурси Культу Дракона та власні магічні здібності,
              Зарладі
              вдалось обманути усіх “союзників” та завершити довгий ритуал в Проклятому Ліцеї Бейна - своїй
              штаб-квартирі
              та колишньому притулку для обдарованих дітей. Намісники фракцій Флану відправились перехопити плани
              тейської
              чарівниці, однак не повернулись.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Поточне місцезнаходження Зарлади невідоме.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <SecretText>
              Більше інформації після проходження завдання “Повернення Червоної Королеви”
            </SecretText>
          </Box>
        
        </Tabs.TabPane>
        {/*Chester*/}
        <Tabs.TabPane
          tab="Честер Ламб"
          key="chester_lamb"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">Честер Ламб</Header>
          </Flex>
          
          <Portrait
            src={chesterPortrait}
            alt="Chester"
            label="Нічого особистого. Лише робота"
            my={30}
          />
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Честер Ламб. Ельф, військовий цілитель. Родом із Кендлкіпа. Дослужився до рангу "Мудра сова", а потім
              несподівано перейшов на сторону Келбена Арунсана, коли трапився розкол серед Арфістів. Довгий час про
              нього не було нічого чути, але кілька років тому він з'явився в околицях Невервінтера в якості найманця. В
              основному супроводжував каравани торговців Півночі та працював охоронцем заможних осіб. Недавно появився у
              Флані, супроводжуючи жінку в червоному каптурі на ім’я Зарлада
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Quote author="зі звіту від шпигуна для Терафіеля з Мірабару"/>
          </Box>
          
          <Box my={10}>
            <SecretText>
              Більше інформації після проходження завдання “Час знімати маски”
            </SecretText>
          </Box>
        
        </Tabs.TabPane>
        {/*Severun*/}
        <Tabs.TabPane
          tab="Северин"
          key="severun"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">Северин</Header>
          </Flex>
          
          <Portrait
            src={severynPortrait}
            alt="Severyn"
            label="Ми усі - лише пилюка під ногами богині Тіамат"
            my={30}
          />
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Лідер “нового” Культу Дракона.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <SecretText>
              Більше інформації після проходження завдання “Башня Ксонтала”
            </SecretText>
          </Box>
        </Tabs.TabPane>
        {/*Джей Джона Джеймсон*/}
        <Tabs.TabPane
          tab="Джей Джона Джеймсон"
          key="john"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">Джей Джона Джеймсон</Header>
          </Flex>
          
          <Portrait
            src={johnPortrait}
            alt="John"
            label="Вбийте когось чи пограбуйте - мені потрібні сенсації! НЕГАЙНО!"
            my={30}
          />
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Одіозний журналіст із Флану, власник “Вісника Флану” - щотижневої газети, яка поширює популістську
              інформацію.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <SecretText>
              Більше інформації після проходження завдання “Повернення у фортецю Сокіл”
            </SecretText>
          </Box>
        
        </Tabs.TabPane>
        {/*Крон Болвар*/}
        <Tabs.TabPane
          tab="Крон Болвер"
          key="cron_bolver"
        >
          <Flex center>
            <Header fontSize={30} fontWeight="bold">Крон Болвер</Header>
          </Flex>
          
          <Portrait
            src={cronPortrait}
            alt="Cron Bolver"
            label="Я приведу Флан до порядку!"
            my={30}
          />
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              Не дивлячись на свою молодість, лицар-лейтенант Болвер є успішним лідером. Він харизматичний та вселяє
              впевненість у своїх підлеглих. Однак, він звик до розкоші, і знає, що за це потрібно платити. Тому будучи
              правою рукою Ектора Брамса, Крон Болвер успішно маніпулював інформацію задля власної вигоди.
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Paragraph fontSize="16px">
              З приходом до влади Культу Дракона, лейтенант пішов вгору по кар’єрній драбині, спершу очоливши Сльози
              Злоби, а згодом і ставши де-факто Намісником Флану. Однак всередині він так і залишився спраглим до наживи
              гімнюком
            </Paragraph>
          </Box>
          
          <Box my={10}>
            <Quote author="з доповіді мисливця Гастона"/>
          </Box>
        </Tabs.TabPane>
      </Tabs>
    </Box>
  )
}

export default Enemies
